{
  "standard": {
    "code": "CIS-v8",
    "name": "CIS Controls Version 8",
    "version": "8.0",
    "organization": "Center for Internet Security (CIS)",
    "published_date": "2021-05-18",
    "description": "The CIS Critical Security Controls are a prioritized set of actions to protect organizations and data from known cyber attack vectors.",
    "website_url": "https://www.cisecurity.org/controls/v8",
    "total_controls": 153
  },
  "controls": [
    {
      "control_id": "CIS-1.1",
      "name": "Establish and Maintain Detailed Enterprise Asset Inventory",
      "family": "Inventory and Control of Enterprise Assets",
      "description": "Establish and maintain an accurate, detailed, and up-to-date inventory of all enterprise assets with the potential to store or process data",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Identify",
      "article": {
        "article_number": "1.1",
        "section_name": "Establish and Maintain Detailed Enterprise Asset Inventory",
        "full_text": "Establish and maintain an accurate, detailed, and up-to-date inventory of all enterprise assets with the potential to store or process data, to include: end-user devices (including portable and mobile), network devices, non-computing/IoT devices, and servers. Ensure the inventory records the network address (if static), hardware address, machine name, enterprise asset owner, department for each asset, and whether the asset has been approved to connect to the network. For mobile end-user devices, MDM type tools can support this process, where appropriate. This inventory includes assets connected to the infrastructure physically, virtually, remotely, and those within cloud environments. Additionally, it includes assets that are regularly connected to the enterprise's network infrastructure, even if they are not under control of the enterprise. Review and update the inventory of all enterprise assets bi-annually, or more frequently.",
        "guidance": "The first step in securing enterprise assets is knowing what needs to be secured. Creating and maintaining an accurate and up-to-date inventory is the foundation for an effective security program. Without knowing what assets exist, how can vulnerabilities be identified and remediated? Organizations should automate the process of maintaining an asset inventory wherever possible. Asset management tools, network discovery tools, and configuration management databases (CMDBs) can help maintain accurate inventories.",
        "external_references": "NIST CSF: ID.AM-1, ISO 27001: A.8.1.1"
      }
    },
    {
      "control_id": "CIS-1.2",
      "name": "Address Unauthorized Assets",
      "family": "Inventory and Control of Enterprise Assets",
      "description": "Ensure that only authorized assets are given access to the network",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Respond",
      "article": {
        "article_number": "1.2",
        "section_name": "Address Unauthorized Assets",
        "full_text": "Ensure that a process exists to address unauthorized assets on a weekly, or more frequent, basis. The enterprise may choose to remove the asset from the network, deny the asset from connecting remotely to the network, or quarantine the asset.",
        "guidance": "Unauthorized assets represent a significant security risk as they are outside the control of the security team and may not have appropriate security controls applied. Automated network access control (NAC) solutions can help identify and remediate unauthorized assets. The response to unauthorized assets should be proportional to the risk they represent.",
        "external_references": "NIST CSF: PR.IP-3, ISO 27001: A.11.2.6"
      }
    },
    {
      "control_id": "CIS-1.3",
      "name": "Utilize an Active Discovery Tool",
      "family": "Inventory and Control of Enterprise Assets",
      "description": "Utilize an active discovery tool to identify assets connected to the enterprise's network",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Detect",
      "article": {
        "article_number": "1.3",
        "section_name": "Utilize an Active Discovery Tool",
        "full_text": "Utilize an active discovery tool to identify assets connected to the enterprise's network. Configure the active discovery tool to execute daily, or more frequently.",
        "guidance": "Passive network monitoring may not detect all assets, particularly those that communicate infrequently. Active discovery tools send queries to identify connected devices. These tools should be configured to run frequently enough to detect new assets quickly. Consider using multiple discovery methods for comprehensive coverage.",
        "external_references": "NIST CSF: ID.AM-1"
      }
    },
    {
      "control_id": "CIS-1.4",
      "name": "Use Dynamic Host Configuration Protocol (DHCP) Logging",
      "family": "Inventory and Control of Enterprise Assets",
      "description": "Use DHCP logging on all DHCP servers to update the enterprise's asset inventory",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Detect",
      "article": {
        "article_number": "1.4",
        "section_name": "Use Dynamic Host Configuration Protocol (DHCP) Logging",
        "full_text": "Use Dynamic Host Configuration Protocol (DHCP) logging on all DHCP servers or Internet Protocol (IP) address management tools to update the enterprise's asset inventory. Review and use logs to update the enterprise's asset inventory weekly, or more frequently.",
        "guidance": "DHCP logs provide valuable information about devices connecting to the network, including MAC addresses, hostnames, and timestamps. This data can help identify new or unauthorized devices. Automated correlation of DHCP logs with asset inventory can improve accuracy.",
        "external_references": "NIST CSF: ID.AM-1"
      }
    },
    {
      "control_id": "CIS-1.5",
      "name": "Use a Passive Asset Discovery Tool",
      "family": "Inventory and Control of Enterprise Assets",
      "description": "Use a passive discovery tool to identify assets connected to the enterprise's network",
      "implementation_group": "IG3",
      "asset_type": "Devices",
      "security_function": "Detect",
      "article": {
        "article_number": "1.5",
        "section_name": "Use a Passive Asset Discovery Tool",
        "full_text": "Use a passive discovery tool to identify assets connected to the enterprise's network. Review and use scans to update the enterprise's asset inventory at least weekly, or more frequently.",
        "guidance": "Passive discovery tools monitor network traffic to identify connected devices without actively querying them. This approach is less intrusive and can detect devices that might not respond to active scans. Combining passive and active discovery provides the most comprehensive visibility.",
        "external_references": "NIST CSF: ID.AM-1"
      }
    },
    {
      "control_id": "CIS-2.1",
      "name": "Establish and Maintain a Software Inventory",
      "family": "Inventory and Control of Software Assets",
      "description": "Establish and maintain a detailed inventory of all licensed software installed on enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Identify",
      "article": {
        "article_number": "2.1",
        "section_name": "Establish and Maintain a Software Inventory",
        "full_text": "Establish and maintain a detailed inventory of all licensed software installed on enterprise assets. The software inventory must document the title, publisher, initial install/use date, and business purpose for each entry; where appropriate, include the Uniform Resource Locator (URL), app store(s), version(s), deployment mechanism, and decommission date. Review and update the software inventory bi-annually, or more frequently.",
        "guidance": "A software inventory is essential for managing licenses, identifying vulnerabilities, and preventing unauthorized software. Automated software inventory tools can integrate with endpoint management systems to maintain accurate records. The inventory should distinguish between authorized and unauthorized software.",
        "external_references": "NIST CSF: ID.AM-2, ISO 27001: A.8.1.1"
      }
    },
    {
      "control_id": "CIS-2.2",
      "name": "Ensure Authorized Software is Currently Supported",
      "family": "Inventory and Control of Software Assets",
      "description": "Ensure that only currently supported software is designated as authorized",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Identify",
      "article": {
        "article_number": "2.2",
        "section_name": "Ensure Authorized Software is Currently Supported",
        "full_text": "Ensure that only currently supported software is designated as authorized in the software inventory for enterprise assets. If software is unsupported, yet necessary for the fulfillment of the enterprise's mission, document an exception detailing mitigating controls and residual risk acceptance. For any unsupported software without an exception documentation, designate as unauthorized. Review the software list to verify software support at least monthly, or more frequently.",
        "guidance": "Unsupported software no longer receives security updates, making it a significant vulnerability. Organizations must track software lifecycles and plan migrations before support ends. Risk acceptance should be formal and include compensating controls.",
        "external_references": "NIST CSF: ID.AM-2"
      }
    },
    {
      "control_id": "CIS-2.3",
      "name": "Address Unauthorized Software",
      "family": "Inventory and Control of Software Assets",
      "description": "Ensure that unauthorized software is either removed or the inventory is updated",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Respond",
      "article": {
        "article_number": "2.3",
        "section_name": "Address Unauthorized Software",
        "full_text": "Ensure that unauthorized software is either removed from use on enterprise assets or receives a documented exception. Review monthly, or more frequently.",
        "guidance": "Unauthorized software may introduce vulnerabilities, violate licensing agreements, or perform malicious activities. Automated tools can detect and remove unauthorized software. Exception processes should require business justification and security review.",
        "external_references": "NIST CSF: PR.IP-3"
      }
    },
    {
      "control_id": "CIS-2.4",
      "name": "Utilize Automated Software Inventory Tools",
      "family": "Inventory and Control of Software Assets",
      "description": "Utilize software inventory tools throughout the enterprise",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Detect",
      "article": {
        "article_number": "2.4",
        "section_name": "Utilize Automated Software Inventory Tools",
        "full_text": "Utilize software inventory tools, when possible, throughout the enterprise to automate the documentation of all software on enterprise assets.",
        "guidance": "Manual software inventory is time-consuming and error-prone. Automated tools can continuously monitor installed software and report changes. These tools should integrate with asset management systems for centralized visibility.",
        "external_references": "NIST CSF: ID.AM-2"
      }
    },
    {
      "control_id": "CIS-2.5",
      "name": "Allowlist Authorized Software",
      "family": "Inventory and Control of Software Assets",
      "description": "Use technical controls to ensure only authorized software can execute",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "2.5",
        "section_name": "Allowlist Authorized Software",
        "full_text": "Use technical controls, such as application allowlisting, to ensure that only authorized software can execute or be accessed. Reassess bi-annually, or more frequently.",
        "guidance": "Application allowlisting prevents unauthorized software from executing, providing strong protection against malware. Implementation should balance security with operational needs. Modern allowlisting solutions use multiple attributes (hash, certificate, path) for flexibility.",
        "external_references": "NIST CSF: PR.PT-2"
      }
    },
    {
      "control_id": "CIS-2.6",
      "name": "Allowlist Authorized Libraries",
      "family": "Inventory and Control of Software Assets",
      "description": "Use technical controls to ensure only authorized software libraries can be loaded",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "2.6",
        "section_name": "Allowlist Authorized Libraries",
        "full_text": "Use technical controls, such as digital signatures and version control, to ensure that only authorized software libraries, such as specific .dll, .ocx, .so, etc., are allowed to load into a system process. Block unauthorized libraries from loading into a system process. Reassess bi-annually, or more frequently.",
        "guidance": "DLL hijacking and library injection are common attack vectors. Allowlisting authorized libraries prevents malicious code execution. This control complements application allowlisting for defense in depth.",
        "external_references": "NIST CSF: PR.PT-2"
      }
    },
    {
      "control_id": "CIS-2.7",
      "name": "Allowlist Authorized Scripts",
      "family": "Inventory and Control of Software Assets",
      "description": "Use technical controls to ensure only authorized scripts can execute",
      "implementation_group": "IG3",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "2.7",
        "section_name": "Allowlist Authorized Scripts",
        "full_text": "Use technical controls, such as digital signatures and version control, to ensure that only authorized scripts, such as specific .ps1, .py, etc., are allowed to execute. Block unauthorized scripts from executing. Reassess bi-annually, or more frequently.",
        "guidance": "Scripts are frequently used by attackers due to their flexibility and prevalence. PowerShell, Python, and other scripting languages should be controlled. Consider script execution policies, digital signing requirements, and constrained language modes.",
        "external_references": "NIST CSF: PR.PT-2"
      }
    },
    {
      "control_id": "CIS-3.1",
      "name": "Establish and Maintain a Data Management Process",
      "family": "Data Protection",
      "description": "Establish and maintain a data management process",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Identify",
      "article": {
        "article_number": "3.1",
        "section_name": "Establish and Maintain a Data Management Process",
        "full_text": "Establish and maintain a data management process. In the process, address data sensitivity, data owner, handling of data, data retention limits, and disposal requirements, based on sensitivity and retention standards for the enterprise. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Understanding what data exists, where it resides, and how sensitive it is forms the foundation of data protection. The data management process should identify data owners, classify data, and establish handling requirements. Regular reviews ensure the process remains current.",
        "external_references": "NIST CSF: ID.AM-5, ISO 27001: A.8.2.1"
      }
    },
    {
      "control_id": "CIS-3.2",
      "name": "Establish and Maintain a Data Inventory",
      "family": "Data Protection",
      "description": "Establish and maintain a data inventory based on the enterprise's data management process",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Identify",
      "article": {
        "article_number": "3.2",
        "section_name": "Establish and Maintain a Data Inventory",
        "full_text": "Establish and maintain a data inventory, based on the enterprise's data management process. Inventory sensitive data, at a minimum. Review and update inventory annually, at a minimum, with a priority on sensitive data.",
        "guidance": "A data inventory documents what sensitive data exists, where it's stored, and who is responsible for it. This enables appropriate protection measures and supports compliance requirements. Data discovery tools can automate inventory creation and maintenance.",
        "external_references": "NIST CSF: ID.AM-5"
      }
    },
    {
      "control_id": "CIS-3.3",
      "name": "Configure Data Access Control Lists",
      "family": "Data Protection",
      "description": "Configure data access control lists based on a user's need to know",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "3.3",
        "section_name": "Configure Data Access Control Lists",
        "full_text": "Configure data access control lists based on a user's need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications.",
        "guidance": "The principle of least privilege should govern data access. Users should only access data necessary for their role. Regular access reviews ensure permissions remain appropriate. Automated tools can help manage and audit access controls.",
        "external_references": "NIST CSF: PR.AC-4, ISO 27001: A.9.4.1"
      }
    },
    {
      "control_id": "CIS-3.4",
      "name": "Enforce Data Retention",
      "family": "Data Protection",
      "description": "Retain data according to the enterprise's data management process",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "3.4",
        "section_name": "Enforce Data Retention",
        "full_text": "Retain data according to the enterprise's data management process. Data retention must include both minimum and maximum timelines.",
        "guidance": "Data retention requirements balance legal/regulatory obligations with storage costs and security risks. Retaining data beyond necessity increases exposure. Automated retention policies ensure consistent application.",
        "external_references": "ISO 27001: A.8.3.3"
      }
    },
    {
      "control_id": "CIS-3.5",
      "name": "Securely Dispose of Data",
      "family": "Data Protection",
      "description": "Securely dispose of data as outlined in the enterprise's data management process",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "3.5",
        "section_name": "Securely Dispose of Data",
        "full_text": "Securely dispose of data as outlined in the enterprise's data management process. Ensure the disposal process and method are commensurate with the data sensitivity.",
        "guidance": "Improper data disposal can lead to unauthorized disclosure. Disposal methods should match data sensitivity: secure deletion for digital data, shredding/incineration for physical media. Verify disposal is complete and irreversible.",
        "external_references": "NIST CSF: PR.IP-6, ISO 27001: A.8.3.2"
      }
    },
    {
      "control_id": "CIS-3.6",
      "name": "Encrypt Data on End-User Devices",
      "family": "Data Protection",
      "description": "Encrypt data on end-user devices containing sensitive data",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "3.6",
        "section_name": "Encrypt Data on End-User Devices",
        "full_text": "Encrypt data on end-user devices containing sensitive data. Example implementations can include: Windows BitLocker®, Apple FileVault®, Linux® dm-crypt.",
        "guidance": "Lost or stolen devices are a common data breach source. Full disk encryption protects data at rest, rendering it unreadable without proper authentication. Modern operating systems include built-in encryption capabilities.",
        "external_references": "NIST CSF: PR.DS-1, ISO 27001: A.8.2.3"
      }
    },
    {
      "control_id": "CIS-3.7",
      "name": "Establish and Maintain a Data Classification Scheme",
      "family": "Data Protection",
      "description": "Establish and maintain an overall data classification scheme for the enterprise",
      "implementation_group": "IG2",
      "asset_type": "Data",
      "security_function": "Identify",
      "article": {
        "article_number": "3.7",
        "section_name": "Establish and Maintain a Data Classification Scheme",
        "full_text": "Establish and maintain an overall data classification scheme for the enterprise. Enterprises may use labels, such as \"Sensitive,\" \"Confidential,\" and \"Public,\" and classify their data according to those labels. Review and update the classification scheme annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Data classification provides a framework for applying appropriate security controls based on sensitivity. The scheme should be simple enough to use consistently but granular enough to differentiate protection needs. Train users on proper classification.",
        "external_references": "NIST CSF: ID.AM-5, ISO 27001: A.8.2.1"
      }
    },
    {
      "control_id": "CIS-3.8",
      "name": "Document Data Flows",
      "family": "Data Protection",
      "description": "Document data flows for sensitive data",
      "implementation_group": "IG2",
      "asset_type": "Data",
      "security_function": "Identify",
      "article": {
        "article_number": "3.8",
        "section_name": "Document Data Flows",
        "full_text": "Document data flows. Data flow documentation includes service provider data flows and should be based on the enterprise's data management process. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Understanding how data moves through systems helps identify security gaps and compliance requirements. Data flow diagrams should show collection points, processing locations, storage systems, and transmission paths. This is essential for privacy impact assessments.",
        "external_references": "NIST CSF: ID.AM-5"
      }
    },
    {
      "control_id": "CIS-3.9",
      "name": "Encrypt Data on Removable Media",
      "family": "Data Protection",
      "description": "Encrypt data on removable media",
      "implementation_group": "IG2",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "3.9",
        "section_name": "Encrypt Data on Removable Media",
        "full_text": "Encrypt data on removable media.",
        "guidance": "Removable media (USB drives, external hard drives) are easily lost or stolen. Encryption protects data if media falls into wrong hands. Consider restricting removable media use through technical controls where appropriate.",
        "external_references": "NIST CSF: PR.DS-1"
      }
    },
    {
      "control_id": "CIS-3.10",
      "name": "Encrypt Sensitive Data in Transit",
      "family": "Data Protection",
      "description": "Encrypt sensitive data in transit",
      "implementation_group": "IG2",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "3.10",
        "section_name": "Encrypt Sensitive Data in Transit",
        "full_text": "Encrypt sensitive data in transit. Example implementations can include: Transport Layer Security (TLS) and Open Secure Shell (OpenSSH).",
        "guidance": "Network traffic can be intercepted, exposing sensitive data. Encryption protects data during transmission. Use strong, current protocols (TLS 1.2+) and disable weak ciphers. Implement certificate validation to prevent man-in-the-middle attacks.",
        "external_references": "NIST CSF: PR.DS-2, ISO 27001: A.10.1.1"
      }
    },
    {
      "control_id": "CIS-3.11",
      "name": "Encrypt Sensitive Data at Rest",
      "family": "Data Protection",
      "description": "Encrypt sensitive data at rest on servers, applications, and databases",
      "implementation_group": "IG2",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "3.11",
        "section_name": "Encrypt Sensitive Data at Rest",
        "full_text": "Encrypt sensitive data at rest on servers, applications, and databases containing sensitive data. Storage-layer encryption, also known as server-side encryption, meets the minimum requirement of this Safeguard. Additional encryption methods may include application-layer encryption, also known as client-side encryption, where access to the data storage device(s) does not permit access to the plain-text data.",
        "guidance": "Database and filesystem encryption protect data if physical media is stolen or improperly disposed. Key management is critical - keys must be protected and rotated regularly. Consider encryption performance impact on high-volume systems.",
        "external_references": "NIST CSF: PR.DS-1, ISO 27001: A.10.1.1"
      }
    },
    {
      "control_id": "CIS-3.12",
      "name": "Segment Data Processing and Storage",
      "family": "Data Protection",
      "description": "Segment data processing and storage based on the sensitivity of the data",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "3.12",
        "section_name": "Segment Data Processing and Storage",
        "full_text": "Segment data processing and storage based on the sensitivity of the data. Do not process sensitive data on enterprise assets intended for lower sensitivity data.",
        "guidance": "Network segmentation limits the impact of a breach. Sensitive data should be isolated on separate systems with stricter controls. This reduces the attack surface and simplifies compliance. Use firewalls, VLANs, and access controls to enforce segmentation.",
        "external_references": "NIST CSF: PR.AC-5"
      }
    },
    {
      "control_id": "CIS-3.13",
      "name": "Deploy a Data Loss Prevention Solution",
      "family": "Data Protection",
      "description": "Deploy an automated tool to prevent sensitive data exfiltration",
      "implementation_group": "IG3",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "3.13",
        "section_name": "Deploy a Data Loss Prevention Solution",
        "full_text": "Deploy an automated tool, such as a host-based Data Loss Prevention (DLP) tool to identify all sensitive data stored, processed, or transmitted through enterprise assets, including those located onsite or at a remote service provider, and update the enterprise's sensitive data inventory.",
        "guidance": "DLP tools monitor data in motion, at rest, and in use to prevent unauthorized disclosure. Effective DLP requires accurate data classification and well-defined policies. Start with monitoring mode before enforcement to tune policies.",
        "external_references": "NIST CSF: PR.DS-5"
      }
    },
    {
      "control_id": "CIS-3.14",
      "name": "Log Sensitive Data Access",
      "family": "Data Protection",
      "description": "Log sensitive data access including modification and disposal",
      "implementation_group": "IG3",
      "asset_type": "Data",
      "security_function": "Detect",
      "article": {
        "article_number": "3.14",
        "section_name": "Log Sensitive Data Access",
        "full_text": "Log sensitive data access, including modification and disposal.",
        "guidance": "Logging sensitive data access enables detection of unauthorized access and supports forensic investigations. Logs should capture who accessed what data, when, and from where. Protect logs from tampering and retain according to policy.",
        "external_references": "NIST CSF: PR.PT-1"
      }
    },
    {
      "control_id": "CIS-4.1",
      "name": "Establish and Maintain a Secure Configuration Process",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Establish and maintain a secure configuration process for enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "4.1",
        "section_name": "Establish and Maintain a Secure Configuration Process",
        "full_text": "Establish and maintain a secure configuration process for enterprise assets (end-user devices, including portable and mobile, non-computing/IoT devices, and servers) and software (operating systems and applications). Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Default configurations are rarely secure. A documented secure configuration process ensures consistent security across assets. The process should define baseline configurations, change procedures, and exception handling. Use industry benchmarks (CIS Benchmarks, DISA STIGs) as starting points.",
        "external_references": "NIST CSF: PR.IP-1, ISO 27001: A.12.6.1"
      }
    },
    {
      "control_id": "CIS-4.2",
      "name": "Establish and Maintain a Secure Configuration Process for Network Infrastructure",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Establish and maintain a secure configuration process for network devices",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "4.2",
        "section_name": "Establish and Maintain a Secure Configuration Process for Network Infrastructure",
        "full_text": "Establish and maintain a secure configuration process for network infrastructure. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Network devices (routers, switches, firewalls) require hardening. Disable unnecessary services, change default credentials, enable logging, and restrict management access. Maintain configuration backups and use configuration management tools.",
        "external_references": "NIST CSF: PR.IP-1"
      }
    },
    {
      "control_id": "CIS-4.3",
      "name": "Configure Automatic Session Locking",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Configure automatic session locking on enterprise assets after inactivity",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "4.3",
        "section_name": "Configure Automatic Session Locking",
        "full_text": "Configure automatic session locking on enterprise assets after a defined period of inactivity. For general purpose operating systems, the period must not exceed 15 minutes. For mobile end-user devices, the period must not exceed 2 minutes.",
        "guidance": "Unattended sessions are vulnerable to unauthorized access. Automatic locking mitigates this risk. Shorter timeouts provide better security but may impact user productivity - balance based on environment sensitivity.",
        "external_references": "NIST CSF: PR.AC-7"
      }
    },
    {
      "control_id": "CIS-4.4",
      "name": "Implement and Manage a Firewall",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Implement and manage a firewall on end-user devices",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "4.4",
        "section_name": "Implement and Manage a Firewall on Servers",
        "full_text": "Implement and manage a firewall on servers, where supported. Example implementations include a virtual firewall, operating system firewall, or a third-party firewall agent.",
        "guidance": "Host-based firewalls provide defense in depth by filtering traffic at the endpoint. Configure firewalls to deny by default and only allow necessary connections. Centralized management ensures consistent policies across the enterprise.",
        "external_references": "NIST CSF: PR.AC-5, ISO 27001: A.13.1.3"
      }
    },
    {
      "control_id": "CIS-4.5",
      "name": "Implement and Manage a Firewall on End-User Devices",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Implement and manage a firewall on end-user devices",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "4.5",
        "section_name": "Implement and Manage a Firewall on End-User Devices",
        "full_text": "Implement and manage a host-based firewall or port-filtering tool on end-user devices, with a default-deny rule that drops all traffic except those services and ports that are explicitly allowed.",
        "guidance": "End-user device firewalls protect against network-based attacks and lateral movement. Enable firewalls by default and prevent users from disabling them. Regular audits ensure firewalls remain enabled and properly configured.",
        "external_references": "NIST CSF: PR.AC-5"
      }
    },
    {
      "control_id": "CIS-4.6",
      "name": "Securely Manage Enterprise Assets and Software",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Securely manage enterprise assets and software",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "4.6",
        "section_name": "Securely Manage Enterprise Assets and Software",
        "full_text": "Securely manage enterprise assets and software. Example implementations include managing configuration through version-controlled-infrastructure-as-code and accessing administrative interfaces over secure network protocols, such as Secure Shell (SSH) and Hypertext Transfer Protocol Secure (HTTPS). Do not use insecure management protocols, such as Telnet (Teletype Network) and HTTP, unless operationally essential.",
        "guidance": "Management interfaces are high-value targets. Protect them with secure protocols, strong authentication, and network segmentation. Infrastructure-as-code enables consistent, auditable configuration management. Eliminate insecure protocols wherever possible.",
        "external_references": "NIST CSF: PR.AC-5"
      }
    },
    {
      "control_id": "CIS-4.7",
      "name": "Manage Default Accounts",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Manage default accounts on enterprise assets and software",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "4.7",
        "section_name": "Manage Default Accounts on Enterprise Assets and Software",
        "full_text": "Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.",
        "guidance": "Default accounts with well-known credentials are frequently exploited. Disable, rename, or change passwords for all default accounts. Audit systems regularly to detect new default accounts introduced by software installations or updates.",
        "external_references": "NIST CSF: PR.AC-1, ISO 27001: A.9.2.3"
      }
    },
    {
      "control_id": "CIS-4.8",
      "name": "Uninstall or Disable Unnecessary Services",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Uninstall or disable unnecessary services on enterprise assets and software",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "4.8",
        "section_name": "Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "full_text": "Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function.",
        "guidance": "Every enabled service increases the attack surface. Disable services not required for business function. Regular reviews identify services that become unnecessary over time. Use minimum viable deployment principles.",
        "external_references": "NIST CSF: PR.IP-1"
      }
    },
    {
      "control_id": "CIS-4.9",
      "name": "Configure Trusted DNS Servers",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Configure trusted DNS servers on enterprise assets",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "4.9",
        "section_name": "Configure Trusted DNS Servers on Enterprise Assets",
        "full_text": "Configure trusted DNS servers on enterprise assets. Example implementations include: configuring assets to use enterprise-controlled DNS servers and/or reputable externally accessible DNS servers.",
        "guidance": "DNS is critical infrastructure that can be attacked to redirect traffic or exfiltrate data. Use trusted, secure DNS servers. Consider DNS filtering services to block malicious domains. Implement DNSSEC where possible.",
        "external_references": "NIST CSF: PR.DS-5"
      }
    },
    {
      "control_id": "CIS-4.10",
      "name": "Enforce Automatic Device Lockout",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Enforce automatic device lockout following failed authentication attempts",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "4.10",
        "section_name": "Enforce Automatic Device Lockout on Portable End-User Devices",
        "full_text": "Enforce automatic device lockout following a predetermined threshold of local failed authentication attempts on portable end-user devices, where supported. For laptops, the lockout must occur after no more than five (5) failed login attempts. For tablets and smartphones, the lockout must occur after no more than ten (10) failed login attempts. Mobile Device Management (MDM) is the recommended solution to enforce device lockouts on mobile end-user devices.",
        "guidance": "Failed login lockout protects against brute force attacks. Balance security with usability - too strict may cause operational issues. Implement account unlocking procedures that verify identity. Track lockout events for anomaly detection.",
        "external_references": "NIST CSF: PR.AC-7"
      }
    },
    {
      "control_id": "CIS-4.11",
      "name": "Enforce Remote Wipe Capability",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Enforce remote wipe capability on portable devices",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "4.11",
        "section_name": "Enforce Remote Wipe Capability on Portable End-User Devices",
        "full_text": "Remotely wipe enterprise data from enterprise-owned portable end-user devices when deemed appropriate such as: lost or stolen devices, devices that are out of compliance with security policies, or devices that are being retired. Mobile Device Management (MDM) tools include the capability to remotely wipe devices.",
        "guidance": "Lost or stolen mobile devices pose significant data breach risk. Remote wipe capabilities enable rapid response. Test wipe functionality regularly. Consider selective wipe to preserve personal data on BYOD devices.",
        "external_references": "NIST CSF: PR.IP-4"
      }
    },
    {
      "control_id": "CIS-4.12",
      "name": "Separate Enterprise Workspaces",
      "family": "Secure Configuration of Enterprise Assets and Software",
      "description": "Separate enterprise workspace from personal workspaces on mobile devices",
      "implementation_group": "IG3",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "4.12",
        "section_name": "Separate Enterprise Workspaces on Mobile End-User Devices",
        "full_text": "Ensure separate enterprise workspaces are used on mobile end-user devices, where supported. Example implementations include: using an Apple® managed Apple ID, Android™ Work Profile, or Microsoft® Intune App Protection Policies. Managed Apple ID is also utilized by mobile devices managed directly through an MDM, where an Apple® Business Manager account has been associated with an enterprise.",
        "guidance": "BYOD creates challenges separating corporate and personal data. Containerization technologies create secure workspaces for enterprise data while respecting privacy. This enables selective wipe of only corporate data.",
        "external_references": "NIST CSF: PR.DS-1"
      }
    },
    {
      "control_id": "CIS-5.1",
      "name": "Establish and Maintain an Inventory of Accounts",
      "family": "Account Management",
      "description": "Establish and maintain an inventory of all accounts managed in the enterprise",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Identify",
      "article": {
        "article_number": "5.1",
        "section_name": "Establish and Maintain an Inventory of Accounts",
        "full_text": "Establish and maintain an inventory of all accounts managed in the enterprise. The inventory must include both user and administrator accounts. The inventory, at a minimum, should contain the person's name, username, start date, and end date. Review the inventory quarterly, or more frequently.",
        "guidance": "Account inventory enables identity governance and access management. Track account lifecycle from creation to deletion. Regular reviews identify orphaned accounts from terminated employees. Automated IAM systems can maintain dynamic inventories.",
        "external_references": "NIST CSF: PR.AC-1, ISO 27001: A.9.2.1"
      }
    },
    {
      "control_id": "CIS-5.2",
      "name": "Use Unique Passwords",
      "family": "Account Management",
      "description": "Use unique passwords for all enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "5.2",
        "section_name": "Use Unique Passwords",
        "full_text": "Use unique passwords for all enterprise assets. Best practice implementation includes, at a minimum, an 8-character password for accounts using MFA and a 14-character password for accounts not using MFA.",
        "guidance": "Password reuse enables credential stuffing attacks. Unique passwords limit breach impact to individual accounts. Password managers facilitate unique password use. Length is more important than complexity for password strength.",
        "external_references": "NIST CSF: PR.AC-1"
      }
    },
    {
      "control_id": "CIS-5.3",
      "name": "Disable Dormant Accounts",
      "family": "Account Management",
      "description": "Delete or disable dormant accounts after 45 days of inactivity",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Respond",
      "article": {
        "article_number": "5.3",
        "section_name": "Disable Dormant Accounts",
        "full_text": "Delete or disable any dormant accounts after a period of 45 days of inactivity, where supported.",
        "guidance": "Dormant accounts are attractive targets as compromise may go unnoticed. Automated processes should flag inactive accounts for review. Consider temporary suspension before permanent deletion. Document exceptions for seasonal workers.",
        "external_references": "NIST CSF: PR.AC-1, ISO 27001: A.9.2.6"
      }
    },
    {
      "control_id": "CIS-5.4",
      "name": "Restrict Administrator Privileges to Dedicated Accounts",
      "family": "Account Management",
      "description": "Restrict administrator privileges to dedicated administrator accounts",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "5.4",
        "section_name": "Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "full_text": "Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user's primary, non-privileged account.",
        "guidance": "Using administrative accounts for routine tasks increases risk. Attackers targeting administrators gain elevated access. Separate accounts for administrative duties limit exposure. Privileged access management (PAM) solutions enforce this separation.",
        "external_references": "NIST CSF: PR.AC-4, ISO 27001: A.9.2.3"
      }
    },
    {
      "control_id": "CIS-5.5",
      "name": "Establish and Maintain an Inventory of Service Accounts",
      "family": "Account Management",
      "description": "Establish and maintain an inventory of service accounts",
      "implementation_group": "IG2",
      "asset_type": "Users",
      "security_function": "Identify",
      "article": {
        "article_number": "5.5",
        "section_name": "Establish and Maintain an Inventory of Service Accounts",
        "full_text": "Establish and maintain an inventory of service accounts. The inventory, at a minimum, must contain department owner, review date, and purpose. Perform service account reviews to validate that all active accounts are authorized, on a recurring schedule at a minimum quarterly, or more frequently.",
        "guidance": "Service accounts often have broad privileges and weak password policies. Maintaining an inventory ensures accountability. Regular reviews identify unused or excessive privileges. Consider managed service identities where possible.",
        "external_references": "NIST CSF: PR.AC-1"
      }
    },
    {
      "control_id": "CIS-5.6",
      "name": "Centralize Account Management",
      "family": "Account Management",
      "description": "Centralize account management through directory services",
      "implementation_group": "IG2",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "5.6",
        "section_name": "Centralize Account Management",
        "full_text": "Centralize account management through a directory or identity service.",
        "guidance": "Centralized identity management enables consistent access control, simplifies administration, and provides centralized audit trails. Directory services (AD, LDAP, cloud identity providers) should be the authoritative source. Integrate applications via SSO where possible.",
        "external_references": "NIST CSF: PR.AC-1, ISO 27001: A.9.2.1"
      }
    },
    {
      "control_id": "CIS-6.1",
      "name": "Establish an Access Granting Process",
      "family": "Access Control Management",
      "description": "Establish and follow a process for granting access to enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "6.1",
        "section_name": "Establish an Access Granting Process",
        "full_text": "Establish and follow a process, preferably automated, for granting access to enterprise assets upon new hire, rights grant, or role change of a user.",
        "guidance": "Formal access provisioning ensures appropriate access based on role. Automated workflows improve speed and consistency while maintaining audit trails. Access should be granted based on principle of least privilege and approved by asset owners.",
        "external_references": "NIST CSF: PR.AC-4, ISO 27001: A.9.2.2"
      }
    },
    {
      "control_id": "CIS-6.2",
      "name": "Establish an Access Revoking Process",
      "family": "Access Control Management",
      "description": "Establish and follow a process for revoking access to enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "6.2",
        "section_name": "Establish an Access Revoking Process",
        "full_text": "Establish and follow a process, preferably automated, for revoking access to enterprise assets, through disabling accounts immediately upon termination, rights revocation, or role change of a user. Disabling accounts, instead of deleting accounts, may be necessary to preserve audit trails.",
        "guidance": "Prompt access revocation upon termination is critical security. Automated deprovisioning triggered by HR systems ensures timely execution. Disable rather than delete to maintain audit trails. Immediately revoke remote access and administrative privileges.",
        "external_references": "NIST CSF: PR.AC-4, ISO 27001: A.9.2.6"
      }
    },
    {
      "control_id": "CIS-6.3",
      "name": "Require MFA for Externally-Exposed Applications",
      "family": "Access Control Management",
      "description": "Require multi-factor authentication for all externally-exposed enterprise applications",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "6.3",
        "section_name": "Require MFA for Externally-Exposed Applications",
        "full_text": "Require all externally-exposed enterprise or third-party applications to enforce MFA, where supported. Enforcing MFA through a directory service or SSO provider is a satisfactory implementation of this Safeguard.",
        "guidance": "Internet-facing applications are constant attack targets. MFA significantly reduces credential compromise risk. Phishing-resistant MFA (hardware tokens, biometrics) provides stronger protection than SMS-based codes. Plan for MFA reset procedures.",
        "external_references": "NIST CSF: PR.AC-7, ISO 27001: A.9.4.2"
      }
    },
    {
      "control_id": "CIS-6.4",
      "name": "Require MFA for Remote Network Access",
      "family": "Access Control Management",
      "description": "Require multi-factor authentication for all remote network access",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "6.4",
        "section_name": "Require MFA for Remote Network Access",
        "full_text": "Require MFA for remote network access.",
        "guidance": "VPN and remote access are frequent attack vectors. MFA prevents unauthorized access from stolen credentials. Consider risk-based authentication that adjusts requirements based on location, device, and behavior patterns.",
        "external_references": "NIST CSF: PR.AC-7"
      }
    },
    {
      "control_id": "CIS-6.5",
      "name": "Require MFA for Administrative Access",
      "family": "Access Control Management",
      "description": "Require multi-factor authentication for all administrative access accounts",
      "implementation_group": "IG1",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "6.5",
        "section_name": "Require MFA for Administrative Access",
        "full_text": "Require MFA for all administrative access accounts, where supported, on all enterprise assets, whether managed on-site or through a third-party provider.",
        "guidance": "Administrative accounts are high-value targets. MFA is essential for protecting privileged access. Use phishing-resistant MFA for administrators. PAM solutions can enforce MFA for administrative sessions.",
        "external_references": "NIST CSF: PR.AC-7, ISO 27001: A.9.4.3"
      }
    },
    {
      "control_id": "CIS-6.6",
      "name": "Establish and Maintain an Inventory of Authentication Systems",
      "family": "Access Control Management",
      "description": "Establish and maintain an inventory of authentication systems",
      "implementation_group": "IG2",
      "asset_type": "Users",
      "security_function": "Identify",
      "article": {
        "article_number": "6.6",
        "section_name": "Establish and Maintain an Inventory of Authentication and Authorization Systems",
        "full_text": "Establish and maintain an inventory of the enterprise's authentication and authorization systems, including those hosted on-site or at a third-party provider. Review and update the inventory, at a minimum, annually, or more frequently.",
        "guidance": "Multiple authentication systems increase complexity and security gaps. Inventory helps consolidate and standardize. Document integration points, supported protocols, and dependencies. Work toward centralized identity management.",
        "external_references": "NIST CSF: ID.AM-1"
      }
    },
    {
      "control_id": "CIS-6.7",
      "name": "Centralize Access Control",
      "family": "Access Control Management",
      "description": "Centralize access control for all enterprise assets",
      "implementation_group": "IG2",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "6.7",
        "section_name": "Centralize Access Control",
        "full_text": "Centralize access control for all enterprise assets through a directory service or SSO provider, where supported.",
        "guidance": "Centralized access control simplifies management and improves security visibility. SSO reduces password fatigue while enabling centralized policies. Implement with strong MFA and monitor for anomalous access patterns.",
        "external_references": "NIST CSF: PR.AC-1"
      }
    },
    {
      "control_id": "CIS-6.8",
      "name": "Define and Maintain Role-Based Access Control",
      "family": "Access Control Management",
      "description": "Define and maintain role-based access control",
      "implementation_group": "IG2",
      "asset_type": "Users",
      "security_function": "Protect",
      "article": {
        "article_number": "6.8",
        "section_name": "Define and Maintain Role-Based Access Control",
        "full_text": "Define and maintain role-based access control, through determining and documenting the access rights necessary for each role within the enterprise to successfully carry out its assigned duties. Perform access control reviews of enterprise assets to validate that all privileges are authorized, on a recurring schedule at a minimum annually, or more frequently.",
        "guidance": "RBAC simplifies access management by granting permissions based on job functions rather than individuals. Document standard roles and their permissions. Regular reviews ensure roles remain appropriate as job functions evolve. Avoid role explosion through careful design.",
        "external_references": "NIST CSF: PR.AC-4, ISO 27001: A.9.2.3"
      }
    },
    {
      "control_id": "CIS-7.1",
      "name": "Establish and Maintain a Vulnerability Management Process",
      "family": "Continuous Vulnerability Management",
      "description": "Establish and maintain a vulnerability management process",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Identify",
      "article": {
        "article_number": "7.1",
        "section_name": "Establish and Maintain a Vulnerability Management Process",
        "full_text": "Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Systematic vulnerability management is essential for maintaining security posture. The process should define roles, scanning frequency, prioritization criteria, and remediation timeframes. Integrate with change management and asset inventory.",
        "external_references": "NIST CSF: ID.RA-1, ISO 27001: A.12.6.1"
      }
    },
    {
      "control_id": "CIS-7.2",
      "name": "Establish and Maintain a Remediation Process",
      "family": "Continuous Vulnerability Management",
      "description": "Establish and maintain a remediation process",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Respond",
      "article": {
        "article_number": "7.2",
        "section_name": "Establish and Maintain a Remediation Process",
        "full_text": "Establish and maintain a risk-based remediation strategy documented in a remediation process, with monthly, or more frequent, reviews.",
        "guidance": "Not all vulnerabilities pose equal risk. Risk-based remediation prioritizes based on exploitability, business impact, and threat intelligence. Define SLAs for different severity levels. Track remediation metrics to measure program effectiveness.",
        "external_references": "NIST CSF: RS.MI-3"
      }
    },
    {
      "control_id": "CIS-7.3",
      "name": "Perform Automated Vulnerability Scans",
      "family": "Continuous Vulnerability Management",
      "description": "Perform automated vulnerability scans of internal enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Detect",
      "article": {
        "article_number": "7.3",
        "section_name": "Perform Automated Operating System Patch Management",
        "full_text": "Perform automated operating system patch management on enterprise assets on a monthly, or more frequent, basis.",
        "guidance": "Operating system vulnerabilities are frequently exploited. Automated patch management ensures timely deployment. Test patches in non-production before widespread deployment. Emergency patching procedures should exist for critical vulnerabilities.",
        "external_references": "NIST CSF: PR.IP-12, ISO 27001: A.12.6.1"
      }
    },
    {
      "control_id": "CIS-7.4",
      "name": "Perform Automated Application Patch Management",
      "family": "Continuous Vulnerability Management",
      "description": "Perform automated application patch management",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "7.4",
        "section_name": "Perform Automated Application Patch Management",
        "full_text": "Perform automated application patch management on a monthly, or more frequent, basis.",
        "guidance": "Applications introduce vulnerabilities distinct from OS patches. Many applications lack auto-update capabilities. Third-party patch management tools can help. Prioritize internet-facing and high-risk applications.",
        "external_references": "NIST CSF: PR.IP-12"
      }
    },
    {
      "control_id": "CIS-7.5",
      "name": "Perform Automated Vulnerability Scans",
      "family": "Continuous Vulnerability Management",
      "description": "Perform automated vulnerability scans of internal systems",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Detect",
      "article": {
        "article_number": "7.5",
        "section_name": "Perform Automated Vulnerability Scans of Internal Enterprise Assets",
        "full_text": "Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.",
        "guidance": "Regular vulnerability scanning identifies security weaknesses before attackers exploit them. Authenticated scans provide deeper visibility. SCAP compliance ensures standardized reporting. Continuous scanning provides better coverage than periodic scans.",
        "external_references": "NIST CSF: DE.CM-8, ISO 27001: A.12.6.1"
      }
    },
    {
      "control_id": "CIS-7.6",
      "name": "Perform Automated Vulnerability Scans of Externally-Exposed Assets",
      "family": "Continuous Vulnerability Management",
      "description": "Perform automated vulnerability scans of externally-exposed enterprise assets",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Detect",
      "article": {
        "article_number": "7.6",
        "section_name": "Perform Automated Vulnerability Scans of Externally-Exposed Enterprise Assets",
        "full_text": "Perform automated vulnerability scans of externally-exposed enterprise assets using a SCAP-compliant vulnerability scanning tool. Perform scans on a monthly, or more frequent, basis.",
        "guidance": "External assets face constant attack. More frequent scanning of internet-facing systems is warranted. Consider continuous external monitoring services. Coordinate scans to avoid triggering security controls or affecting availability.",
        "external_references": "NIST CSF: DE.CM-8"
      }
    },
    {
      "control_id": "CIS-7.7",
      "name": "Remediate Detected Vulnerabilities",
      "family": "Continuous Vulnerability Management",
      "description": "Remediate detected vulnerabilities in software within timeframes based on risk",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Respond",
      "article": {
        "article_number": "7.7",
        "section_name": "Remediate Detected Vulnerabilities",
        "full_text": "Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.",
        "guidance": "Vulnerability discovery is meaningless without remediation. Track time-to-remediate metrics. When patches aren't available, implement compensating controls. Vulnerability management tools should integrate with ticketing systems for workflow.",
        "external_references": "NIST CSF: RS.MI-3, ISO 27001: A.12.6.1"
      }
    },
    {
      "control_id": "CIS-8.1",
      "name": "Establish and Maintain an Audit Log Management Process",
      "family": "Audit Log Management",
      "description": "Establish and maintain an audit log management process",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "8.1",
        "section_name": "Establish and Maintain an Audit Log Management Process",
        "full_text": "Establish and maintain an audit log management process that defines the enterprise's logging requirements. At a minimum, address the collection, review, and retention of audit logs for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Logs provide evidence of security events and support incident investigation. The log management process should define what to log, retention periods, review procedures, and protection measures. Consider regulatory requirements when setting retention policies.",
        "external_references": "NIST CSF: PR.PT-1, ISO 27001: A.12.4.1"
      }
    },
    {
      "control_id": "CIS-8.2",
      "name": "Collect Audit Logs",
      "family": "Audit Log Management",
      "description": "Collect audit logs from enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "8.2",
        "section_name": "Collect Audit Logs",
        "full_text": "Collect audit logs. Ensure that logging, per the enterprise's audit log management process, has been enabled across enterprise assets.",
        "guidance": "Comprehensive logging is foundational for security monitoring. Enable logging on operating systems, applications, network devices, and security tools. Ensure time synchronization for accurate correlation. Monitor for logging failures.",
        "external_references": "NIST CSF: DE.AE-3, ISO 27001: A.12.4.1"
      }
    },
    {
      "control_id": "CIS-8.3",
      "name": "Ensure Adequate Audit Log Storage",
      "family": "Audit Log Management",
      "description": "Ensure adequate storage for all collected audit logs",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "8.3",
        "section_name": "Ensure Adequate Audit Log Storage",
        "full_text": "Ensure that logging destinations maintain adequate storage to comply with the enterprise's audit log management process.",
        "guidance": "Insufficient storage causes log loss, creating security blind spots. Monitor storage capacity and plan for growth. Consider tiered storage: hot storage for recent logs, cold storage for archives. Compression can extend capacity.",
        "external_references": "NIST CSF: PR.PT-1"
      }
    },
    {
      "control_id": "CIS-8.4",
      "name": "Standardize Time Synchronization",
      "family": "Audit Log Management",
      "description": "Standardize time synchronization across all enterprise assets",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "8.4",
        "section_name": "Standardize Time Synchronization",
        "full_text": "Standardize time synchronization. Configure enterprise assets to synchronize time with an authenticated and designated time source to ensure that any discrepancies can be corrected.",
        "guidance": "Accurate timestamps are critical for log correlation and forensics. Use NTP with authenticated time sources. Monitor for time drift. Maintain redundant time sources for reliability. Document timezone handling in log management.",
        "external_references": "NIST CSF: DE.AE-3, ISO 27001: A.12.4.4"
      }
    },
    {
      "control_id": "CIS-8.5",
      "name": "Collect Detailed Audit Logs",
      "family": "Audit Log Management",
      "description": "Collect detailed audit logs with all relevant information",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "8.5",
        "section_name": "Collect Detailed Audit Logs",
        "full_text": "Configure detailed audit logging for enterprise assets containing sensitive data. Include event source, date, username, timestamp, source addresses, destination addresses, and other useful elements that could assist in a forensic investigation.",
        "guidance": "Detailed logs support effective investigation. Log verbosity should balance detail with storage/performance. Focus detailed logging on high-value assets and sensitive data. Ensure personally identifiable information in logs is handled appropriately.",
        "external_references": "NIST CSF: DE.AE-3"
      }
    },
    {
      "control_id": "CIS-8.6",
      "name": "Collect DNS Query Audit Logs",
      "family": "Audit Log Management",
      "description": "Collect DNS query audit logs",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "8.6",
        "section_name": "Collect DNS Query Audit Logs",
        "full_text": "Collect DNS query audit logs on enterprise assets, where appropriate and supported.",
        "guidance": "DNS queries reveal communication patterns and can indicate malicious activity (C2 communications, data exfiltration, malware). DNS logging should capture query, response, source, and timestamp. Consider privacy implications of DNS logging.",
        "external_references": "NIST CSF: DE.AE-3"
      }
    },
    {
      "control_id": "CIS-8.7",
      "name": "Collect URL Request Audit Logs",
      "family": "Audit Log Management",
      "description": "Collect URL request audit logs",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "8.7",
        "section_name": "Collect URL Request Audit Logs",
        "full_text": "Collect URL request audit logs on enterprise assets, where appropriate and supported.",
        "guidance": "URL logs help identify malicious sites, policy violations, and data exfiltration. Web proxies and secure web gateways provide this capability. Balance security visibility with user privacy. Consider SSL/TLS inspection for encrypted traffic.",
        "external_references": "NIST CSF: DE.AE-3"
      }
    },
    {
      "control_id": "CIS-8.8",
      "name": "Collect Command-Line Audit Logs",
      "family": "Audit Log Management",
      "description": "Collect command-line audit logs",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Detect",
      "article": {
        "article_number": "8.8",
        "section_name": "Collect Command-Line Audit Logs",
        "full_text": "Collect command-line audit logs. Example implementations include collecting audit logs from PowerShell®, BASH™, and remote administrative terminals.",
        "guidance": "Command-line activity reveals attacker actions and insider threats. PowerShell, Bash, and other shells should have enhanced logging enabled. Be mindful of sensitive data in command parameters. Consider obfuscating passwords in logs.",
        "external_references": "NIST CSF: DE.CM-1"
      }
    },
    {
      "control_id": "CIS-8.9",
      "name": "Centralize Audit Logs",
      "family": "Audit Log Management",
      "description": "Centralize audit log collection and retention",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "8.9",
        "section_name": "Centralize Audit Logs",
        "full_text": "Centralize, to the extent possible, audit log collection and retention across enterprise assets.",
        "guidance": "Centralized logging enables efficient analysis, correlation, and long-term retention. SIEM or log management systems aggregate logs from multiple sources. Protect log infrastructure as it contains sensitive information. Ensure secure log transmission.",
        "external_references": "NIST CSF: DE.AE-3, ISO 27001: A.12.4.1"
      }
    },
    {
      "control_id": "CIS-8.10",
      "name": "Retain Audit Logs",
      "family": "Audit Log Management",
      "description": "Retain audit logs for appropriate time periods",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "8.10",
        "section_name": "Retain Audit Logs",
        "full_text": "Retain audit logs across enterprise assets for a minimum of 90 days.",
        "guidance": "Retention periods should support incident investigation while considering storage costs and regulatory requirements. Longer retention may be required for compliance. Archive old logs to cold storage. Protect archived logs from tampering.",
        "external_references": "NIST CSF: PR.PT-1, ISO 27001: A.12.4.1"
      }
    },
    {
      "control_id": "CIS-8.11",
      "name": "Conduct Audit Log Reviews",
      "family": "Audit Log Management",
      "description": "Conduct reviews of audit logs to detect anomalies",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "8.11",
        "section_name": "Conduct Audit Log Reviews",
        "full_text": "Conduct reviews of audit logs to detect anomalies or abnormal events that could indicate a potential threat. Conduct reviews on a weekly, or more frequent, basis.",
        "guidance": "Logs are worthless without analysis. Regular reviews identify suspicious activity. SIEM tools automate analysis using correlation rules and anomaly detection. Focus reviews on high-value assets and known attack patterns. Document findings.",
        "external_references": "NIST CSF: DE.AE-5, ISO 27001: A.12.4.1"
      }
    },
    {
      "control_id": "CIS-8.12",
      "name": "Collect Service Provider Logs",
      "family": "Audit Log Management",
      "description": "Collect service provider logs",
      "implementation_group": "IG3",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "8.12",
        "section_name": "Collect Service Provider Logs",
        "full_text": "Collect service provider logs, where supported. Example implementations include collecting authentication and authorization events, data creation and disposal events, and user management events.",
        "guidance": "Cloud and SaaS provider logs are essential for comprehensive visibility. API access may be required to collect logs. Integrate provider logs into central log management. Understand provider retention policies and export logs as needed.",
        "external_references": "NIST CSF: DE.AE-3"
      }
    },
    {
      "control_id": "CIS-9.1",
      "name": "Ensure Use of Only Fully Supported Browsers and Email Clients",
      "family": "Email and Web Browser Protections",
      "description": "Ensure only fully supported browsers and email clients are allowed",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "9.1",
        "section_name": "Ensure Use of Only Fully Supported Browsers and Email Clients",
        "full_text": "Ensure only fully supported browsers and email clients are allowed to execute in the enterprise, only using the latest version of browsers and email clients provided through the vendor.",
        "guidance": "Browsers and email clients are common attack vectors. Unsupported versions contain known vulnerabilities. Automated tools can enforce supported versions. Consider enterprise browser management solutions for centralized control and updates.",
        "external_references": "NIST CSF: PR.IP-1"
      }
    },
    {
      "control_id": "CIS-9.2",
      "name": "Use DNS Filtering Services",
      "family": "Email and Web Browser Protections",
      "description": "Use DNS filtering services to block access to known malicious domains",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "9.2",
        "section_name": "Use DNS Filtering Services",
        "full_text": "Use DNS filtering services on all enterprise assets to block access to known malicious domains.",
        "guidance": "DNS filtering prevents connections to malicious sites before they occur. Services provide regularly updated threat intelligence. Can block phishing, malware, and C2 traffic. Works across all applications using DNS. Consider redundant DNS filtering for reliability.",
        "external_references": "NIST CSF: DE.CM-7"
      }
    },
    {
      "control_id": "CIS-9.3",
      "name": "Maintain and Enforce Network-Based URL Filters",
      "family": "Email and Web Browser Protections",
      "description": "Enforce URL filtering to limit website access",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "9.3",
        "section_name": "Maintain and Enforce Network-Based URL Filters",
        "full_text": "Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.",
        "guidance": "URL filtering extends beyond DNS to block access by category or reputation. Web proxies and secure web gateways provide this capability. Policies should balance security with productivity. Regular review and updating of filter policies is essential.",
        "external_references": "NIST CSF: PR.AC-5"
      }
    },
    {
      "control_id": "CIS-9.4",
      "name": "Restrict Unnecessary or Unauthorized Browser and Email Client Extensions",
      "family": "Email and Web Browser Protections",
      "description": "Restrict browser and email client extensions",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "9.4",
        "section_name": "Restrict Unnecessary or Unauthorized Browser and Email Client Extensions",
        "full_text": "Restrict, either through uninstalling or disabling, any unauthorized or unnecessary browser or email client plugins, extensions, and add-on applications.",
        "guidance": "Extensions can access sensitive data and introduce vulnerabilities. Maintain allowlist of approved extensions. Enterprise browser management can enforce extension policies. Review extensions for excessive permissions. Consider browser isolation for high-risk browsing.",
        "external_references": "NIST CSF: PR.PT-3"
      }
    },
    {
      "control_id": "CIS-9.5",
      "name": "Implement DMARC",
      "family": "Email and Web Browser Protections",
      "description": "Implement DMARC policy to protect against email spoofing",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "9.5",
        "section_name": "Implement DMARC",
        "full_text": "To lower the chance of spoofed or modified emails from valid domains, implement DMARC policy and verification, starting with implementing the Sender Policy Framework (SPF) and the DomainKeys Identified Mail (DKIM) standards.",
        "guidance": "DMARC protects against email spoofing and phishing. Start with monitoring mode (p=none), then progress to quarantine or reject policies. SPF and DKIM must be properly configured first. Monitor DMARC reports to identify legitimate vs. malicious email sources.",
        "external_references": "NIST SP 800-177"
      }
    },
    {
      "control_id": "CIS-9.6",
      "name": "Block Unnecessary File Types",
      "family": "Email and Web Browser Protections",
      "description": "Block unnecessary file types from email",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "9.6",
        "section_name": "Block Unnecessary File Types",
        "full_text": "Block unnecessary file types attempting to enter the enterprise's email gateway.",
        "guidance": "Many file types are rarely legitimate business email attachments but commonly used for malware (e.g., .exe, .scr, .vbs). Email gateways can block or quarantine these. Document exceptions with justification. Consider blocking by MIME type, not just extension.",
        "external_references": "NIST CSF: DE.CM-4"
      }
    },
    {
      "control_id": "CIS-9.7",
      "name": "Deploy and Maintain Email Server Anti-Malware Protections",
      "family": "Email and Web Browser Protections",
      "description": "Deploy anti-malware on email servers",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "9.7",
        "section_name": "Deploy and Maintain Email Server Anti-Malware Protections",
        "full_text": "Deploy and maintain email server anti-malware protections, such as attachment scanning and/or sandboxing.",
        "guidance": "Email is a primary malware delivery mechanism. Multi-layer scanning (gateway, server, endpoint) provides defense in depth. Sandboxing detonates suspicious attachments in isolated environments. Keep signatures and detection engines updated.",
        "external_references": "NIST CSF: DE.CM-4"
      }
    },
    {
      "control_id": "CIS-10.1",
      "name": "Deploy and Maintain Anti-Malware Software",
      "family": "Malware Defenses",
      "description": "Deploy anti-malware software on all enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "10.1",
        "section_name": "Deploy and Maintain Anti-Malware Software",
        "full_text": "Deploy and maintain anti-malware software on all enterprise assets.",
        "guidance": "Anti-malware is fundamental security control. Should be deployed on endpoints, servers, and network devices where supported. Centralized management ensures consistent deployment and configuration. Next-generation solutions use behavior-based detection beyond signatures.",
        "external_references": "NIST CSF: DE.CM-4, ISO 27001: A.12.2.1"
      }
    },
    {
      "control_id": "CIS-10.2",
      "name": "Configure Automatic Anti-Malware Signature Updates",
      "family": "Malware Defenses",
      "description": "Configure automatic signature updates for anti-malware",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "10.2",
        "section_name": "Configure Automatic Anti-Malware Signature Updates",
        "full_text": "Configure automatic updates for anti-malware signature files on all enterprise assets.",
        "guidance": "Outdated signatures cannot detect new threats. Automatic updates ensure timely protection. Configure updates to occur multiple times daily. Monitor update success. For air-gapped systems, establish manual update procedures. Consider cloud-delivered protection for real-time updates.",
        "external_references": "NIST CSF: DE.CM-4"
      }
    },
    {
      "control_id": "CIS-10.3",
      "name": "Disable Autorun and Autoplay for Removable Media",
      "family": "Malware Defenses",
      "description": "Disable autorun/autoplay for removable media",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "10.3",
        "section_name": "Disable Autorun and Autoplay for Removable Media",
        "full_text": "Disable autorun and autoplay auto-execute functionality for removable media.",
        "guidance": "Autorun/autoplay can automatically execute malware from USB drives and other removable media. Disabling prevents automatic malware execution. Configure through Group Policy or endpoint management. Consider blocking removable media entirely for high-security environments.",
        "external_references": "NIST CSF: PR.PT-2"
      }
    },
    {
      "control_id": "CIS-10.4",
      "name": "Configure Automatic Anti-Malware Scanning",
      "family": "Malware Defenses",
      "description": "Configure automatic anti-malware scanning",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Detect",
      "article": {
        "article_number": "10.4",
        "section_name": "Configure Automatic Anti-Malware Scanning",
        "full_text": "Configure anti-malware software to automatically scan removable media.",
        "guidance": "Real-time scanning detects malware upon access. Schedule regular full system scans. Balance scan frequency with performance impact. Configure scanning of email attachments, downloads, and file shares. Ensure scans include compressed and archived files.",
        "external_references": "NIST CSF: DE.CM-4"
      }
    },
    {
      "control_id": "CIS-10.5",
      "name": "Enable Anti-Exploitation Features",
      "family": "Malware Defenses",
      "description": "Enable anti-exploitation features on enterprise assets",
      "implementation_group": "IG1",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "10.5",
        "section_name": "Enable Anti-Exploitation Features",
        "full_text": "Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.",
        "guidance": "Anti-exploitation features prevent exploit techniques (DEP, ASLR, control flow guard). Modern operating systems include these protections. Ensure they're enabled and not disabled for compatibility. Third-party solutions provide additional protection. Test application compatibility.",
        "external_references": "NIST CSF: PR.IP-1"
      }
    },
    {
      "control_id": "CIS-10.6",
      "name": "Centrally Manage Anti-Malware Software",
      "family": "Malware Defenses",
      "description": "Centrally manage anti-malware software",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "10.6",
        "section_name": "Centrally Manage Anti-Malware Software",
        "full_text": "Use a centrally managed anti-malware software to continuously monitor and defend each of the enterprise's workstations and servers.",
        "guidance": "Central management ensures consistent policies, monitoring, and reporting. Prevents users from disabling protection. Provides visibility into malware detections across the enterprise. Enables rapid response to new threats. Supports compliance reporting.",
        "external_references": "NIST CSF: DE.CM-4"
      }
    },
    {
      "control_id": "CIS-10.7",
      "name": "Use Behavior-Based Anti-Malware Software",
      "family": "Malware Defenses",
      "description": "Use behavior-based anti-malware",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Detect",
      "article": {
        "article_number": "10.7",
        "section_name": "Use Behavior-Based Anti-Malware Software",
        "full_text": "Use behavior-based anti-malware software.",
        "guidance": "Signature-based detection cannot catch zero-day malware. Behavior-based detection identifies malicious activities regardless of signature. Machine learning and AI enhance detection. EDR solutions provide advanced behavior monitoring. Balance detection sensitivity with false positives.",
        "external_references": "NIST CSF: DE.CM-4"
      }
    },
    {
      "control_id": "CIS-11.1",
      "name": "Establish and Maintain a Data Recovery Process",
      "family": "Data Recovery",
      "description": "Establish data recovery processes",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Recover",
      "article": {
        "article_number": "11.1",
        "section_name": "Establish and Maintain a Data Recovery Process",
        "full_text": "Establish and maintain a data recovery process. In the process, address the scope of data recovery activities, recovery prioritization, and the security of backup data. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Data recovery is critical for business continuity and ransomware recovery. Document RTO and RPO for each system. Define backup scope including systems, applications, and data. Address backup security (encryption, access controls). Test recovery procedures regularly.",
        "external_references": "NIST CSF: PR.IP-4, ISO 27001: A.12.3.1"
      }
    },
    {
      "control_id": "CIS-11.2",
      "name": "Perform Automated Backups",
      "family": "Data Recovery",
      "description": "Perform automated backups of critical data",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "11.2",
        "section_name": "Perform Automated Backups",
        "full_text": "Perform automated backups of in-scope enterprise assets. Run backups weekly, or more frequently, based on the sensitivity of the data.",
        "guidance": "Manual backups are unreliable. Automation ensures consistent backup execution. Frequency should match data change rate and RPO. Consider continuous data protection for critical systems. Implement 3-2-1 backup strategy (3 copies, 2 media types, 1 offsite).",
        "external_references": "NIST CSF: PR.IP-4"
      }
    },
    {
      "control_id": "CIS-11.3",
      "name": "Protect Recovery Data",
      "family": "Data Recovery",
      "description": "Protect backup and recovery data",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "11.3",
        "section_name": "Protect Recovery Data",
        "full_text": "Protect recovery data with equivalent controls to the original data. Reference encryption or data separation, based on requirements.",
        "guidance": "Backups contain sensitive data requiring protection. Encrypt backups at rest and in transit. Apply access controls limiting backup access. Store backups separately from production to prevent concurrent compromise. Consider immutable backups to prevent ransomware encryption.",
        "external_references": "NIST CSF: PR.DS-1, ISO 27001: A.12.3.1"
      }
    },
    {
      "control_id": "CIS-11.4",
      "name": "Establish and Maintain an Isolated Instance of Recovery Data",
      "family": "Data Recovery",
      "description": "Maintain isolated backup copies",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Protect",
      "article": {
        "article_number": "11.4",
        "section_name": "Establish and Maintain an Isolated Instance of Recovery Data",
        "full_text": "Establish and maintain an isolated instance of recovery data. Example implementations include version controlling backup destinations through offline, cloud, or off-site systems or services.",
        "guidance": "Isolated backups protect against ransomware and malicious insiders. Air-gapped, offline, or cloud backups prevent simultaneous compromise. Implement network segmentation for backup infrastructure. Consider write-once-read-many (WORM) storage. Geographic separation protects against local disasters.",
        "external_references": "NIST CSF: PR.IP-4"
      }
    },
    {
      "control_id": "CIS-11.5",
      "name": "Test Data Recovery",
      "family": "Data Recovery",
      "description": "Test data recovery procedures",
      "implementation_group": "IG1",
      "asset_type": "Data",
      "security_function": "Recover",
      "article": {
        "article_number": "11.5",
        "section_name": "Test Data Recovery",
        "full_text": "Test backup recovery quarterly, or more frequently, for a sampling of in-scope enterprise assets.",
        "guidance": "Untested backups may fail when needed. Regular testing validates backup integrity and recovery procedures. Test full and partial recovery scenarios. Document recovery times to verify RTO/RPO. Include testing in disaster recovery exercises. Rotate tested systems to provide comprehensive coverage.",
        "external_references": "NIST CSF: RC.RP-1, ISO 27001: A.17.1.3"
      }
    },
    {
      "control_id": "CIS-12.1",
      "name": "Ensure Network Infrastructure is Up-to-Date",
      "family": "Network Infrastructure Management",
      "description": "Keep network infrastructure current and supported",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "12.1",
        "section_name": "Ensure Network Infrastructure is Up-to-Date",
        "full_text": "Ensure network infrastructure is kept up-to-date. Example implementations include running the latest stable release of software and/or using currently supported network-as-a-service (NaaS) offerings. Review software versions monthly, or more frequently.",
        "guidance": "Network devices are critical infrastructure requiring current software. Outdated firmware contains vulnerabilities. Maintain inventory of network devices with software versions. Plan upgrades before end-of-support. Test updates in non-production before deploying. Subscribe to vendor security advisories.",
        "external_references": "NIST CSF: PR.IP-1, ISO 27001: A.12.6.1"
      }
    },
    {
      "control_id": "CIS-12.2",
      "name": "Establish and Maintain a Secure Network Architecture",
      "family": "Network Infrastructure Management",
      "description": "Design and maintain secure network architecture",
      "implementation_group": "IG1",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "12.2",
        "section_name": "Establish and Maintain a Secure Network Architecture",
        "full_text": "Establish and maintain a secure network architecture. A secure network architecture must address segmentation, least privilege, and availability, at a minimum.",
        "guidance": "Network architecture should implement defense in depth. Segment networks by security zone (DMZ, internal, management). Apply least privilege to network flows. Use VLANs, firewalls, and micro-segmentation. Document architecture with network diagrams. Review architecture when adding new services or systems.",
        "external_references": "NIST CSF: PR.AC-5, ISO 27001: A.13.1.3"
      }
    },
    {
      "control_id": "CIS-12.3",
      "name": "Securely Manage Network Infrastructure",
      "family": "Network Infrastructure Management",
      "description": "Implement secure management of network devices",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "12.3",
        "section_name": "Securely Manage Network Infrastructure",
        "full_text": "Securely manage network infrastructure. Example implementations include version-controlled-infrastructure-as-code, and the use of secure network protocols, such as SSH and HTTPS. Do not use insecure management protocols, such as Telnet (Teletype Network) and HTTP, unless operationally essential.",
        "guidance": "Insecure protocols transmit credentials in clear text. Use SSH, HTTPS, SNMPv3 for device management. Separate management network from production. Restrict management access by source IP. Use jump hosts for administrative access. Implement multi-factor authentication for network device access.",
        "external_references": "NIST CSF: PR.AC-4, ISO 27001: A.9.4.1"
      }
    },
    {
      "control_id": "CIS-12.4",
      "name": "Establish and Maintain Architecture Diagram(s)",
      "family": "Network Infrastructure Management",
      "description": "Document network architecture",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Identify",
      "article": {
        "article_number": "12.4",
        "section_name": "Establish and Maintain Architecture Diagram(s)",
        "full_text": "Establish and maintain architecture diagram(s) and/or other network system documentation. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Network diagrams are essential for understanding security posture, troubleshooting, and planning. Document physical and logical topology, security zones, trust boundaries, and data flows. Include IP addressing, device inventory, and security controls. Use automated tools to maintain accuracy.",
        "external_references": "NIST CSF: ID.AM-4, ISO 27001: A.13.1.1"
      }
    },
    {
      "control_id": "CIS-12.5",
      "name": "Centralize Network Authentication, Authorization, and Auditing",
      "family": "Network Infrastructure Management",
      "description": "Centralize AAA for network devices",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "12.5",
        "section_name": "Centralize Network Authentication, Authorization, and Auditing",
        "full_text": "Centralize network authentication, authorization, and auditing (AAA) for all network devices.",
        "guidance": "Centralized AAA (RADIUS, TACACS+) simplifies credential management and provides consistent auditing. Eliminates shared local accounts on devices. Supports role-based access control. Provides audit trail of administrative actions. Implement redundant AAA servers for availability.",
        "external_references": "NIST CSF: PR.AC-1, ISO 27001: A.9.2.1"
      }
    },
    {
      "control_id": "CIS-12.6",
      "name": "Use of Secure Network Management and Communication Protocols",
      "family": "Network Infrastructure Management",
      "description": "Use secure protocols for network management",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "12.6",
        "section_name": "Use of Secure Network Management and Communication Protocols",
        "full_text": "Use secure network management and communication protocols (e.g., 802.1X, Wi-Fi Protected Access 2 (WPA2) Enterprise or WPA3).",
        "guidance": "Weak wireless security allows unauthorized access. WPA3 provides strongest protection; WPA2-Enterprise is minimum. Disable WEP and WPA-Personal. Use 802.1X for wired and wireless authentication. Implement certificate-based authentication where possible. Regularly rotate pre-shared keys if used.",
        "external_references": "NIST SP 800-97, NIST SP 800-153"
      }
    },
    {
      "control_id": "CIS-12.7",
      "name": "Ensure Remote Devices Utilize a VPN",
      "family": "Network Infrastructure Management",
      "description": "Require VPN for remote access",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "12.7",
        "section_name": "Ensure Remote Devices Utilize a VPN",
        "full_text": "Require users to authenticate to enterprise-managed VPN and authentication services prior to accessing enterprise resources on end-user devices.",
        "guidance": "VPN protects data in transit and extends network security to remote users. Implement strong VPN protocols (IPsec, SSL/TLS). Require multi-factor authentication for VPN access. Consider split-tunneling risks. Modern alternatives include zero trust network access (ZTNA).",
        "external_references": "NIST SP 800-77, NIST SP 800-113"
      }
    },
    {
      "control_id": "CIS-12.8",
      "name": "Establish and Maintain Dedicated Computing Resources",
      "family": "Network Infrastructure Management",
      "description": "Use dedicated resources for high-risk activities",
      "implementation_group": "IG3",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "12.8",
        "section_name": "Establish and Maintain Dedicated Computing Resources",
        "full_text": "Establish and maintain dedicated computing resources, either physically or logically separated, for all administrative tasks or tasks requiring administrative access. The dedicated computing resources need to be segmented from the enterprise's primary network through either physical or logical means.",
        "guidance": "Dedicated administrative workstations reduce compromise risk. Privileged Access Workstations (PAWs) separate high-privilege activities. Jump hosts provide controlled access. Browser isolation protects against web-based attacks. Implement strict access controls and monitoring for admin systems.",
        "external_references": "NIST SP 800-53 AC-6(2)"
      }
    },
    {
      "control_id": "CIS-13.1",
      "name": "Centralize Security Event Alerting",
      "family": "Network Monitoring and Defense",
      "description": "Centralize security event alerting and analysis",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "13.1",
        "section_name": "Centralize Security Event Alerting",
        "full_text": "Centralize security event alerting across enterprise assets for log correlation and analysis. Best practice implementation requires the use of a SIEM, which includes vendor-defined event correlation alerts. A log analytics platform configured with security-relevant correlation alerts also satisfies this Safeguard.",
        "guidance": "SIEM enables detection of complex attack patterns across multiple systems. Aggregate logs from network devices, servers, applications, and endpoints. Develop correlation rules for known attack patterns. Integrate threat intelligence. Configure alerts for suspicious activities. Tune to reduce false positives.",
        "external_references": "NIST CSF: DE.AE-3, ISO 27001: A.12.4.1"
      }
    },
    {
      "control_id": "CIS-13.2",
      "name": "Deploy a Host-Based Intrusion Detection Solution",
      "family": "Network Monitoring and Defense",
      "description": "Deploy HIDS on enterprise assets",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Detect",
      "article": {
        "article_number": "13.2",
        "section_name": "Deploy a Host-Based Intrusion Detection Solution",
        "full_text": "Deploy a host-based intrusion detection solution on enterprise assets, where appropriate and/or supported.",
        "guidance": "HIDS monitors system calls, file integrity, and log files for suspicious activity. Complements network-based detection. EDR solutions provide advanced HIDS capabilities. Configure alerts for configuration changes, privilege escalation, and unauthorized access attempts. Integrate with SIEM.",
        "external_references": "NIST CSF: DE.CM-1"
      }
    },
    {
      "control_id": "CIS-13.3",
      "name": "Deploy a Network Intrusion Detection Solution",
      "family": "Network Monitoring and Defense",
      "description": "Deploy NIDS for network monitoring",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "13.3",
        "section_name": "Deploy a Network Intrusion Detection Solution",
        "full_text": "Deploy a network intrusion detection solution on enterprise assets, where appropriate. Example implementations include the use of a Network Intrusion Detection System (NIDS) or equivalent cloud service provider (CSP) service.",
        "guidance": "NIDS analyzes network traffic for attack signatures and anomalies. Deploy sensors at key network locations (perimeter, between security zones). Keep signatures updated. Tune to environment to reduce false positives. Consider network traffic analysis (NTA) for advanced threat detection.",
        "external_references": "NIST CSF: DE.CM-1"
      }
    },
    {
      "control_id": "CIS-13.4",
      "name": "Perform Traffic Filtering Between Network Segments",
      "family": "Network Monitoring and Defense",
      "description": "Filter traffic between network segments",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "13.4",
        "section_name": "Perform Traffic Filtering Between Network Segments",
        "full_text": "Perform traffic filtering between network segments, where appropriate.",
        "guidance": "Network segmentation limits lateral movement during breaches. Firewalls between segments enforce access policies. Define allowed traffic between zones using least privilege. Monitor inter-segment traffic for anomalies. Micro-segmentation provides granular control. Document firewall rules and review regularly.",
        "external_references": "NIST CSF: PR.AC-5, ISO 27001: A.13.1.3"
      }
    },
    {
      "control_id": "CIS-13.5",
      "name": "Manage Access Control for Remote Assets",
      "family": "Network Monitoring and Defense",
      "description": "Control remote asset access to internal resources",
      "implementation_group": "IG2",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "13.5",
        "section_name": "Manage Access Control for Remote Assets",
        "full_text": "Manage access control for assets remotely connecting to enterprise resources. Determine amount of access to enterprise resources based on: up-to-date anti-malware software installed, configuration compliance with the enterprise's secure configuration process, and ensuring the operating system and applications are up-to-date.",
        "guidance": "Network Access Control (NAC) verifies device health before granting access. Check for current patches, anti-malware, and configuration compliance. Quarantine non-compliant devices. Provide remediation guidance. Consider zero trust approach requiring continuous verification.",
        "external_references": "NIST CSF: PR.AC-5"
      }
    },
    {
      "control_id": "CIS-13.6",
      "name": "Collect Network Traffic Flow Logs",
      "family": "Network Monitoring and Defense",
      "description": "Collect and analyze network flow data",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "13.6",
        "section_name": "Collect Network Traffic Flow Logs",
        "full_text": "Collect network traffic flow logs and/or network traffic to review and alert upon from network devices.",
        "guidance": "Network flow logs (NetFlow, sFlow, IPFIX) provide visibility into network communications. Useful for detecting C2 traffic, data exfiltration, and lateral movement. Lightweight compared to full packet capture. Analyze flows for volume anomalies, unusual destinations, and off-hours activity.",
        "external_references": "NIST CSF: DE.AE-3"
      }
    },
    {
      "control_id": "CIS-13.7",
      "name": "Deploy a Host-Based Intrusion Prevention Solution",
      "family": "Network Monitoring and Defense",
      "description": "Deploy HIPS on enterprise assets",
      "implementation_group": "IG3",
      "asset_type": "Devices",
      "security_function": "Protect",
      "article": {
        "article_number": "13.7",
        "section_name": "Deploy a Host-Based Intrusion Prevention Solution",
        "full_text": "Deploy a host-based intrusion prevention solution on enterprise assets, where appropriate and/or supported. Example implementations include use of an Endpoint Detection and Response (EDR) client or host-based IPS agent.",
        "guidance": "HIPS prevents attacks by blocking malicious activities. EDR solutions provide prevention, detection, and response capabilities. Can prevent exploits, credential theft, and malicious scripts. Requires careful tuning to avoid disrupting legitimate activities. Integrate with threat intelligence.",
        "external_references": "NIST CSF: DE.CM-1"
      }
    },
    {
      "control_id": "CIS-13.8",
      "name": "Deploy a Network Intrusion Prevention Solution",
      "family": "Network Monitoring and Defense",
      "description": "Deploy NIPS for inline traffic inspection",
      "implementation_group": "IG3",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "13.8",
        "section_name": "Deploy a Network Intrusion Prevention Solution",
        "full_text": "Deploy a network intrusion prevention solution, where appropriate. Example implementations include the use of a Network Intrusion Prevention System (NIPS) or equivalent CSP service.",
        "guidance": "NIPS blocks attacks in real-time by sitting inline in network path. Can prevent exploits, malware downloads, and C2 communications. Performance impact requires consideration. Keep signatures updated. Tune to balance protection with false positive blocking. Deploy at critical network boundaries.",
        "external_references": "NIST CSF: DE.CM-1"
      }
    },
    {
      "control_id": "CIS-13.9",
      "name": "Deploy Port-Level Access Control",
      "family": "Network Monitoring and Defense",
      "description": "Implement port-level access control",
      "implementation_group": "IG3",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "13.9",
        "section_name": "Deploy Port-Level Access Control",
        "full_text": "Deploy port-level access control. Port-level access control utilizes 802.1x, or similar network access control protocols, such as certificates, and may incorporate user and/or device authentication.",
        "guidance": "802.1X authenticates devices before granting network access. Prevents unauthorized devices from connecting to network ports. Works with RADIUS/certificate authorities. Can be combined with dynamic VLAN assignment. Consider for both wired and wireless networks. Guest network should be isolated.",
        "external_references": "NIST SP 800-120"
      }
    },
    {
      "control_id": "CIS-13.10",
      "name": "Perform Application Layer Filtering",
      "family": "Network Monitoring and Defense",
      "description": "Filter traffic using application awareness",
      "implementation_group": "IG3",
      "asset_type": "Network",
      "security_function": "Protect",
      "article": {
        "article_number": "13.10",
        "section_name": "Perform Application Layer Filtering",
        "full_text": "Perform application layer filtering. Example implementations include a filtering proxy, application layer firewall, or gateway.",
        "guidance": "Application-layer filtering inspects traffic beyond port/protocol. Next-generation firewalls provide this capability. Can identify applications regardless of port. Enforce application usage policies. Detect and block tunneling and evasion techniques. Provides granular control over application features.",
        "external_references": "NIST CSF: PR.PT-4"
      }
    },
    {
      "control_id": "CIS-13.11",
      "name": "Tune Security Event Alerting Thresholds",
      "family": "Network Monitoring and Defense",
      "description": "Tune alerting to reduce false positives",
      "implementation_group": "IG3",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "13.11",
        "section_name": "Tune Security Event Alerting Thresholds",
        "full_text": "Tune security event alerting thresholds monthly, or more frequently.",
        "guidance": "Excessive false positives cause alert fatigue and missed real threats. Regular tuning improves signal-to-noise ratio. Track alert accuracy metrics. Adjust correlation rules and thresholds. Suppress known benign activities. Document tuning decisions. Balance sensitivity with false positive rate.",
        "external_references": "NIST CSF: DE.AE-5"
      }
    },
    {
      "control_id": "CIS-14.1",
      "name": "Establish and Maintain a Security Awareness Program",
      "family": "Security Awareness and Skills Training",
      "description": "Implement security awareness training program",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "14.1",
        "section_name": "Establish and Maintain a Security Awareness Program",
        "full_text": "Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise's workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Users are often the weakest link in security. Regular training reduces human-related risks. Cover phishing, password security, physical security, and reporting procedures. Track training completion. Use varied delivery methods (videos, newsletters, posters). Make training relevant to job roles.",
        "external_references": "NIST SP 800-50, ISO 27001: A.7.2.2"
      }
    },
    {
      "control_id": "CIS-14.2",
      "name": "Train Workforce Members to Recognize Social Engineering Attacks",
      "family": "Security Awareness and Skills Training",
      "description": "Train users to recognize social engineering",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "14.2",
        "section_name": "Train Workforce Members to Recognize Social Engineering Attacks",
        "full_text": "Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.",
        "guidance": "Social engineering bypasses technical controls. Training should include email phishing, phone vishing, SMS smishing, and physical pretexting. Use simulated phishing campaigns to test and train. Provide clear reporting mechanisms. Reward reporting of suspicious activities. Update training with current attack trends.",
        "external_references": "NIST SP 800-50"
      }
    },
    {
      "control_id": "CIS-14.3",
      "name": "Train Workforce Members on Authentication Best Practices",
      "family": "Security Awareness and Skills Training",
      "description": "Train users on authentication security",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "14.3",
        "section_name": "Train Workforce Members on Authentication Best Practices",
        "full_text": "Train workforce members on authentication best practices. Example topics include MFA, password composition, and credential management.",
        "guidance": "Weak authentication practices lead to account compromise. Train on password strength, unique passwords per site, password manager use, MFA benefits, and protecting credentials. Explain common credential theft techniques. Demonstrate secure authentication methods. Emphasize never sharing passwords.",
        "external_references": "NIST SP 800-63B"
      }
    },
    {
      "control_id": "CIS-14.4",
      "name": "Train Workforce on Data Handling Best Practices",
      "family": "Security Awareness and Skills Training",
      "description": "Train users on secure data handling",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "14.4",
        "section_name": "Train Workforce on Data Handling Best Practices",
        "full_text": "Train workforce members on how to identify and properly store, transfer, archive, and destroy sensitive data. This also includes training workforce members on clear screen and desk best practices, such as locking their screen when they step away from their enterprise asset, erasing physical and virtual whiteboards at the end of meetings, and storing data and assets securely.",
        "guidance": "Improper data handling causes breaches. Train on data classification, encryption requirements, secure transmission methods, and proper disposal. Cover physical security (clean desk, screen locking, document shredding). Address cloud storage and file sharing risks. Emphasize data minimization principles.",
        "external_references": "ISO 27001: A.7.2.2"
      }
    },
    {
      "control_id": "CIS-14.5",
      "name": "Train Workforce Members on Causes of Unintentional Data Exposure",
      "family": "Security Awareness and Skills Training",
      "description": "Train on unintentional data exposure risks",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "14.5",
        "section_name": "Train Workforce Members on Causes of Unintentional Data Exposure",
        "full_text": "Train workforce members to be aware of causes for unintentional data exposure. Example topics include mis-delivery of sensitive data, losing a portable end-user device, or publishing data to unintended audiences.",
        "guidance": "Accidental exposure is common breach cause. Train on risks of: misdirected emails, public cloud storage, lost devices, oversharing on collaboration platforms, and misconfigured permissions. Emphasize verifying recipients before sending. Promote use of DLP tools. Encourage reporting of potential exposures.",
        "external_references": "ISO 27001: A.7.2.2"
      }
    },
    {
      "control_id": "CIS-14.6",
      "name": "Train Workforce Members on Recognizing and Reporting Security Incidents",
      "family": "Security Awareness and Skills Training",
      "description": "Train users on incident recognition and reporting",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Detect",
      "article": {
        "article_number": "14.6",
        "section_name": "Train Workforce Members on Recognizing and Reporting Security Incidents",
        "full_text": "Train workforce members to be able to recognize a potential incident and be able to report such an incident.",
        "guidance": "Early detection enables rapid response. Train users to recognize signs of compromise (unusual system behavior, unexpected emails, suspicious network activity). Provide clear, simple reporting mechanisms. Ensure non-punitive reporting culture. Acknowledge and reward reporting. Follow up on reports promptly.",
        "external_references": "NIST SP 800-61"
      }
    },
    {
      "control_id": "CIS-14.7",
      "name": "Train Workforce on How to Identify and Report if Their Enterprise Assets are Missing Security Updates",
      "family": "Security Awareness and Skills Training",
      "description": "Train users to identify missing security updates",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Detect",
      "article": {
        "article_number": "14.7",
        "section_name": "Train Workforce on Identifying Missing Security Updates",
        "full_text": "Train workforce on how to identify out-of-date software on their enterprise assets, and how to report such findings.",
        "guidance": "Users can help identify unpatched systems. Train on checking software versions, recognizing update notifications, and understanding update importance. Provide reporting channel for outdated software. While automated patching is preferred, user awareness provides additional layer. Explain risks of ignoring updates.",
        "external_references": "NIST CSF: PR.IP-12"
      }
    },
    {
      "control_id": "CIS-14.8",
      "name": "Train Workforce on the Dangers of Connecting to and Transmitting Enterprise Data Over Insecure Networks",
      "family": "Security Awareness and Skills Training",
      "description": "Train on insecure network risks",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "14.8",
        "section_name": "Train on Insecure Network Dangers",
        "full_text": "Train workforce members on the dangers of connecting to, and transmitting enterprise data over, insecure networks for enterprise activities. If the enterprise has remote workers, training must include guidance to ensure that all users securely configure their home network infrastructure.",
        "guidance": "Public WiFi and untrusted networks pose eavesdropping risks. Train on VPN use before accessing enterprise resources. Explain risks of public WiFi for sensitive activities. Provide guidance on securing home networks (changing default passwords, enabling encryption, updating router firmware). Recommend avoiding public networks for high-sensitivity work.",
        "external_references": "NIST SP 800-46"
      }
    },
    {
      "control_id": "CIS-14.9",
      "name": "Conduct Role-Specific Security Awareness and Skills Training",
      "family": "Security Awareness and Skills Training",
      "description": "Provide role-specific security training",
      "implementation_group": "IG3",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "14.9",
        "section_name": "Conduct Role-Specific Security Training",
        "full_text": "Conduct role-specific security awareness and skills training. Example implementations include secure system administration, secure software development, and security product usage.",
        "guidance": "Different roles require specific security knowledge. Developers need secure coding training. Administrators need secure configuration and privilege management training. Security staff need technical skills training. Tailor content to job responsibilities. Provide hands-on training where appropriate. Consider certifications for critical roles.",
        "external_references": "NIST SP 800-16, ISO 27001: A.7.2.2"
      }
    },
    {
      "control_id": "CIS-15.1",
      "name": "Establish and Maintain an Inventory of Service Providers",
      "family": "Service Provider Management",
      "description": "Maintain inventory of service providers",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Identify",
      "article": {
        "article_number": "15.1",
        "section_name": "Establish and Maintain Service Provider Inventory",
        "full_text": "Establish and maintain an inventory of service providers. The inventory is to list all known service providers, include classification(s), and designate an enterprise contact for each service provider. Review and update the inventory annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Third-party risks require visibility into service providers. Inventory should include cloud providers, SaaS vendors, managed services, outsourced functions. Document data access, criticality, and contract details. Classify by risk level. Review regularly as provider relationships change. Track subcontractors/fourth parties.",
        "external_references": "NIST CSF: ID.SC-1, ISO 27001: A.15.1.1"
      }
    },
    {
      "control_id": "CIS-15.2",
      "name": "Establish and Maintain a Service Provider Management Policy",
      "family": "Service Provider Management",
      "description": "Create service provider management policy",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "15.2",
        "section_name": "Establish Service Provider Management Policy",
        "full_text": "Establish and maintain a service provider management policy. Ensure the policy addresses the classification, inventory, assessment, monitoring, and decommissioning of service providers. Review and update the policy annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Formalized policy ensures consistent vendor risk management. Policy should cover vendor selection criteria, due diligence requirements, contract security provisions, ongoing monitoring, and off-boarding. Define roles and responsibilities. Address data protection, audit rights, and incident notification requirements. Align with procurement processes.",
        "external_references": "ISO 27001: A.15.1.1"
      }
    },
    {
      "control_id": "CIS-15.3",
      "name": "Classify Service Providers",
      "family": "Service Provider Management",
      "description": "Classify service providers by risk",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Identify",
      "article": {
        "article_number": "15.3",
        "section_name": "Classify Service Providers",
        "full_text": "Classify service providers. Classification consideration may include one or more characteristics, such as data sensitivity, and provider type. Update and review classifications annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Risk-based classification enables proportionate controls. Consider: data accessed, system criticality, regulatory requirements, and financial impact. High-risk providers require enhanced due diligence and monitoring. Classification drives assessment frequency and control requirements. Document classification criteria.",
        "external_references": "NIST CSF: ID.SC-2"
      }
    },
    {
      "control_id": "CIS-15.4",
      "name": "Ensure Service Provider Contracts Include Security Requirements",
      "family": "Service Provider Management",
      "description": "Include security requirements in contracts",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "15.4",
        "section_name": "Include Security Requirements in Service Provider Contracts",
        "full_text": "Ensure service provider contracts include security requirements. Example requirements may include minimum security program requirements, security incident and/or data breach notification and response, data encryption requirements, and data disposal commitments. These security requirements must be consistent with the enterprise's service provider management policy. Review service provider contracts annually to ensure contracts are not missing security requirements.",
        "guidance": "Contracts establish security expectations and remedies. Include: security standards compliance, audit/assessment rights, incident notification timelines, data handling requirements, subcontractor restrictions, insurance requirements, right to terminate for security cause. Review contracts before signing. Engage legal and security teams.",
        "external_references": "ISO 27001: A.15.1.2"
      }
    },
    {
      "control_id": "CIS-15.5",
      "name": "Assess Service Providers",
      "family": "Service Provider Management",
      "description": "Assess service provider security controls",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Identify",
      "article": {
        "article_number": "15.5",
        "section_name": "Assess Service Providers",
        "full_text": "Assess service providers consistent with the enterprise's service provider management policy. Assessment scope may vary based on classification(s), and may include review of security program documentation, security capabilities, and security requirements. Assess service providers upon selection and on an annual basis, at a minimum.",
        "guidance": "Due diligence validates provider security posture. Methods include security questionnaires, SOC reports, certifications (ISO 27001, SOC 2), onsite assessments. Assessment depth should match risk classification. Evaluate controls relevant to data/services provided. Document findings and track remediation. Consider shared assessments to reduce redundancy.",
        "external_references": "NIST CSF: ID.SC-3, ISO 27001: A.15.2.1"
      }
    },
    {
      "control_id": "CIS-15.6",
      "name": "Monitor Service Providers",
      "family": "Service Provider Management",
      "description": "Monitor ongoing service provider security",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Detect",
      "article": {
        "article_number": "15.6",
        "section_name": "Monitor Service Providers",
        "full_text": "Monitor service providers consistent with the enterprise's service provider management policy. Monitoring may include periodic reassessment of service provider compliance, monitoring service provider release notes, and dark web monitoring.",
        "guidance": "Continuous monitoring detects provider security degradation. Track security incidents, breaches, and vulnerabilities affecting providers. Monitor for changes in certifications/attestations. Subscribe to provider security bulletins. Use threat intelligence for provider compromise monitoring. Conduct periodic reassessments. Review SLA compliance including security metrics.",
        "external_references": "NIST CSF: ID.SC-4"
      }
    },
    {
      "control_id": "CIS-15.7",
      "name": "Securely Decommission Service Providers",
      "family": "Service Provider Management",
      "description": "Securely off-board service providers",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "15.7",
        "section_name": "Securely Decommission Service Providers",
        "full_text": "Securely decommission service providers. Example considerations include user and service account deactivation, termination of data flows, and secure disposal of enterprise data within service provider systems.",
        "guidance": "Proper off-boarding prevents unauthorized data access. Checklist should include: revoke provider access, retrieve or destroy enterprise data, terminate network connections, recover physical assets, conduct final audit, document completion. Verify data deletion per contract. Address data in backups. Remove provider from security exceptions.",
        "external_references": "ISO 27001: A.15.1.3"
      }
    },
    {
      "control_id": "CIS-16.1",
      "name": "Establish and Maintain a Secure Application Development Process",
      "family": "Application Software Security",
      "description": "Implement secure development lifecycle",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "16.1",
        "section_name": "Establish Secure Application Development Process",
        "full_text": "Establish and maintain a secure application development process. In the process, address such items as: secure application design standards, secure coding practices, developer training, vulnerability management, security testing, and security requirements definition.",
        "guidance": "Security must be integrated throughout SDLC. Adopt secure development framework (OWASP, Microsoft SDL, BSIMM). Define security requirements early. Conduct threat modeling. Implement secure coding standards. Use static and dynamic analysis. Perform security testing before release. Include security gates in CI/CD pipeline.",
        "external_references": "NIST SP 800-218, ISO 27034, OWASP SAMM"
      }
    },
    {
      "control_id": "CIS-16.2",
      "name": "Establish and Maintain a Process to Accept and Address Software Vulnerabilities",
      "family": "Application Software Security",
      "description": "Implement vulnerability disclosure process",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Respond",
      "article": {
        "article_number": "16.2",
        "section_name": "Process to Accept and Address Software Vulnerabilities",
        "full_text": "Establish and maintain a process to accept and address reports of software vulnerabilities, including providing a means for external entities to report. The process is to include such items as: a vulnerability disclosure policy, a reporting mechanism (e.g., a bug bounty program, a vulnerability submission form, or a monitored email address), and a mechanism for acknowledging receipt of reported vulnerabilities. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "External researchers find valuable vulnerabilities. Vulnerability disclosure policy sets expectations for reporters. Provide clear reporting mechanism (security@, bug bounty program). Acknowledge reports promptly. Provide timelines for remediation. Recognize helpful reporters. Consider bug bounty programs. Coordinate disclosure timing. Follow responsible disclosure practices.",
        "external_references": "ISO 29147 (Vulnerability Disclosure)"
      }
    },
    {
      "control_id": "CIS-16.3",
      "name": "Perform Root Cause Analysis on Security Vulnerabilities",
      "family": "Application Software Security",
      "description": "Analyze vulnerability root causes",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Respond",
      "article": {
        "article_number": "16.3",
        "section_name": "Perform Root Cause Analysis on Security Vulnerabilities",
        "full_text": "Perform root cause analysis on security vulnerabilities. When reviewing vulnerabilities, root cause analysis is the task of evaluating underlying issues that create vulnerabilities in code, and allows development teams to move beyond just fixing individual vulnerabilities as they arise.",
        "guidance": "Root cause analysis prevents vulnerability recurrence. Look beyond individual bugs to systemic issues. Common root causes: inadequate input validation, insecure defaults, missing access controls, cryptographic weaknesses. Use findings to improve secure coding training, standards, and tools. Track vulnerability patterns. Share lessons learned with development teams.",
        "external_references": "OWASP SAMM"
      }
    },
    {
      "control_id": "CIS-16.4",
      "name": "Establish and Manage an Inventory of Third-Party Software Components",
      "family": "Application Software Security",
      "description": "Inventory third-party software components",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Identify",
      "article": {
        "article_number": "16.4",
        "section_name": "Inventory Third-Party Software Components",
        "full_text": "Establish and manage an updated inventory of third-party components used in development, often referred to as a \"bill of materials,\" as well as components slated for future use. This inventory is to include any risks that each third-party component could pose. Review and update this inventory monthly, or more frequently.",
        "guidance": "Third-party components introduce supply chain risks. Maintain software bill of materials (SBOM) listing all dependencies. Track component versions, licenses, and known vulnerabilities. Use software composition analysis (SCA) tools. Monitor for newly disclosed vulnerabilities in components. Have process to update or replace vulnerable components. Consider component risk in selection.",
        "external_references": "NIST SP 800-218, NTIA SBOM"
      }
    },
    {
      "control_id": "CIS-16.5",
      "name": "Use Up-to-Date and Trusted Third-Party Software Components",
      "family": "Application Software Security",
      "description": "Use current and trusted third-party components",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "16.5",
        "section_name": "Use Up-to-Date and Trusted Third-Party Components",
        "full_text": "Use up-to-date and trusted third-party software components. When possible, choose established and proven frameworks and libraries that provide adequate security. Acquire these components from trusted sources or evaluate the software for vulnerabilities before use.",
        "guidance": "Outdated components contain known vulnerabilities. Keep dependencies current with security patches. Use reputable sources for components (official repositories, verified publishers). Evaluate component security before adoption. Prefer well-maintained projects with active communities. Consider component popularity and maturity. Scan components for vulnerabilities before use.",
        "external_references": "OWASP Top 10 A06:2021 (Vulnerable and Outdated Components)"
      }
    },
    {
      "control_id": "CIS-16.6",
      "name": "Establish and Maintain a Severity Rating System and Process for Application Vulnerabilities",
      "family": "Application Software Security",
      "description": "Rate application vulnerability severity",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Respond",
      "article": {
        "article_number": "16.6",
        "section_name": "Severity Rating System for Application Vulnerabilities",
        "full_text": "Establish and maintain a severity rating system and process for application vulnerabilities that facilitates prioritizing the order in which discovered vulnerabilities are fixed. This process includes setting a minimum level of security acceptability for releasing code or applications. Severity ratings bring a systematic way of triaging vulnerabilities that improves risk management and helps ensure the most critical vulnerabilities are addressed swiftly.",
        "guidance": "Severity ratings prioritize remediation efforts. Use standardized scoring (CVSS, OWASP Risk Rating). Consider exploitability, impact, and affected systems. Define SLAs for remediation by severity. Establish quality gates for releases (no criticals, limited highs). Risk acceptance should require executive approval. Track remediation metrics. Automate severity assignment where possible.",
        "external_references": "CVSS, OWASP Risk Rating Methodology"
      }
    },
    {
      "control_id": "CIS-16.7",
      "name": "Use Standard Hardening Configuration Templates for Application Infrastructure",
      "family": "Application Software Security",
      "description": "Harden application infrastructure",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "16.7",
        "section_name": "Standard Hardening Configuration for Application Infrastructure",
        "full_text": "Use standard, industry-recommended hardening configuration templates for application infrastructure components. This includes underlying servers, databases, and web servers, and applies to cloud containers, Platform as a Service (PaaS) components, or system images used by Infrastructure as a Service (IaaS) components. Do not allow in-house developed software to weaken configuration hardening.",
        "guidance": "Hardened infrastructure reduces attack surface. Use CIS Benchmarks, DISA STIGs, or vendor hardening guides. Apply principle of least functionality—disable unnecessary services and features. Harden web servers, application servers, and databases. Implement security headers. Configure TLS properly. Use infrastructure as code for consistent deployment. Scan for configuration issues.",
        "external_references": "CIS Benchmarks, NIST SP 800-123"
      }
    },
    {
      "control_id": "CIS-16.8",
      "name": "Separate Production and Non-Production Systems",
      "family": "Application Software Security",
      "description": "Segregate production and non-production environments",
      "implementation_group": "IG1",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "16.8",
        "section_name": "Separate Production and Non-Production Systems",
        "full_text": "Maintain separate environments for production and non-production systems. Designers and developers should not have unmonitored access to production systems.",
        "guidance": "Production/non-production separation prevents accidental production changes and protects production data. Use separate networks, accounts, and credentials. Restrict developer access to production. Sanitize production data before use in non-production. Implement change control between environments. Monitor production access. Use production-like non-production environments for realistic testing.",
        "external_references": "NIST SP 800-53 SC-7"
      }
    },
    {
      "control_id": "CIS-16.9",
      "name": "Train Developers in Application Security Concepts and Secure Coding",
      "family": "Application Software Security",
      "description": "Provide secure coding training to developers",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Protect",
      "article": {
        "article_number": "16.9",
        "section_name": "Train Developers in Application Security",
        "full_text": "Ensure that all software development personnel receive training in writing secure code for their specific development environment and responsibilities. Training can include general security principles and application security standard practices. Conduct training at least annually and update it regularly with new security techniques and best practices.",
        "guidance": "Developer knowledge is critical for secure applications. Training should cover OWASP Top 10, secure coding for specific languages/frameworks, common vulnerability types, and secure design principles. Use hands-on labs and code examples. Provide reference materials and secure coding checklists. Consider security champions program. Make training relevant to technologies used.",
        "external_references": "OWASP Top 10, SAFECode training guides"
      }
    },
    {
      "control_id": "CIS-16.10",
      "name": "Apply Secure Design Principles in Application Architectures",
      "family": "Application Software Security",
      "description": "Use secure design principles",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "16.10",
        "section_name": "Apply Secure Design Principles",
        "full_text": "Apply secure design principles in application architectures. Secure design principles include the concept of least privilege and enforcing mediation to validate every operation that the user makes, promoting the concept of \"never trust user input.\" Examples include ensuring that explicit error checking is performed and documented for all input, including for size, data type, and acceptable ranges or formats. Secure design also means minimizing the application infrastructure attack surface, such as turning off unprotected ports and services, removing unnecessary programs and files, and renaming or removing default accounts.",
        "guidance": "Secure design prevents entire vulnerability classes. Apply principles: least privilege, defense in depth, fail securely, separation of duties, economy of mechanism, complete mediation, open design, least common mechanism. Never trust user input—validate all input. Use threat modeling during design. Design for security from the start rather than adding it later. Document security design decisions.",
        "external_references": "OWASP ASVS, Saltzer and Schroeder Security Principles"
      }
    },
    {
      "control_id": "CIS-16.11",
      "name": "Leverage Vetted Modules or Services for Application Security Components",
      "family": "Application Software Security",
      "description": "Use proven security libraries",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Protect",
      "article": {
        "article_number": "16.11",
        "section_name": "Leverage Vetted Security Modules",
        "full_text": "Leverage vetted modules or services for application security components, such as identity management, encryption, and auditing and logging. Using platform features in critical security functions will reduce developers' workload and minimize the likelihood of design or implementation errors. Modern operating systems provide effective mechanisms for identification, authentication, and authorization and make those mechanisms available to applications. Use only standardized, currently accepted, and extensively reviewed encryption algorithms. Operating systems also provide mechanisms to create and maintain secure audit logs.",
        "guidance": "Don't roll your own crypto or authentication. Use established, vetted libraries for security functions. Leverage platform security features (OS authentication, cryptographic APIs). Use OAuth/OIDC for authorization, bcrypt/Argon2 for password hashing, TLS for encryption. Proven libraries have been extensively tested and reviewed. Custom security code often contains flaws.",
        "external_references": "OWASP Cryptographic Storage Cheat Sheet"
      }
    },
    {
      "control_id": "CIS-16.12",
      "name": "Implement Code-Level Security Checks",
      "family": "Application Software Security",
      "description": "Perform security checks during development",
      "implementation_group": "IG2",
      "asset_type": "Applications",
      "security_function": "Detect",
      "article": {
        "article_number": "16.12",
        "section_name": "Implement Code-Level Security Checks",
        "full_text": "Apply static and dynamic analysis tools to verify that secure coding practices are being followed and to identify potential software security weaknesses. Security weaknesses found during the code review are to be tracked and addressed in a timely manner. Static and dynamic analysis tools must be updated regularly for accurate detection of coding weaknesses.",
        "guidance": "Automated code analysis finds vulnerabilities early. Static analysis (SAST) scans source code without execution. Dynamic analysis (DAST) tests running applications. Interactive analysis (IAST) combines both approaches. Integrate into CI/CD pipeline. Set quality gates based on findings. Tune tools to reduce false positives. Combine with manual code review. Track and remediate findings.",
        "external_references": "OWASP Code Review Guide, NIST SP 800-218"
      }
    },
    {
      "control_id": "CIS-16.13",
      "name": "Conduct Application Penetration Testing",
      "family": "Application Software Security",
      "description": "Test applications for security vulnerabilities",
      "implementation_group": "IG3",
      "asset_type": "Applications",
      "security_function": "Detect",
      "article": {
        "article_number": "16.13",
        "section_name": "Conduct Application Penetration Testing",
        "full_text": "Conduct penetration testing on web-based and other application software prior to release, using techniques that exploit common vulnerabilities, including but not limited to authorization and authentication, and input validation. Applications that consume third-party components or APIs should be tested for vulnerabilities within the integrated application.",
        "guidance": "Penetration testing validates security in realistic attack scenarios. Test before initial release and after significant changes. Include OWASP Top 10 vulnerabilities. Test authentication, authorization, input validation, session management. Test APIs and integrations. Use both automated scanning and manual testing. Remediate findings before release. Consider bug bounty programs for ongoing testing.",
        "external_references": "OWASP Testing Guide, PTES"
      }
    },
    {
      "control_id": "CIS-16.14",
      "name": "Conduct Threat Modeling",
      "family": "Application Software Security",
      "description": "Perform threat modeling for applications",
      "implementation_group": "IG3",
      "asset_type": "Applications",
      "security_function": "Identify",
      "article": {
        "article_number": "16.14",
        "section_name": "Conduct Threat Modeling",
        "full_text": "Conduct threat modeling for high-value, high-risk, or mission-critical applications. This helps identify and address potential security design flaws within an application early in the development lifecycle. Conduct threat modeling every three years at a minimum, or when a significant change is made to an application or application hosting infrastructure. When modeling, consider technologies, applications, services, and threat actors that may or may not be currently supported or known. Threat modeling can inform security requirements for technologies, applications, and services that may also have implications on how to securely configure such technologies, applications, and services.",
        "guidance": "Threat modeling identifies security risks during design. Use structured approach (STRIDE, PASTA, Attack Trees). Document assets, entry points, trust boundaries, and data flows. Identify threats for each component. Prioritize threats by risk. Define mitigations. Update models as architecture changes. Engage developers, architects, and security team. Document findings and track mitigation implementation.",
        "external_references": "OWASP Threat Modeling, Microsoft Threat Modeling Tool"
      }
    },
    {
      "control_id": "CIS-17.1",
      "name": "Perform a Skills Gap Analysis",
      "family": "Incident Response Management",
      "description": "Assess incident response capability gaps",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Identify",
      "article": {
        "article_number": "17.1",
        "section_name": "Perform Skills Gap Analysis",
        "full_text": "Perform a skills gap analysis to understand the roles and skills required to support security operations, and use gap analysis to determine training requirements.",
        "guidance": "Understanding capability gaps enables targeted improvement. Assess current incident response capabilities against required skills. Identify gaps in people, process, and technology. Consider incident types likely to affect organization. Plan training, hiring, or outsourcing to address gaps. Review annually as threats and technology evolve. Document findings and improvement plans.",
        "external_references": "NIST SP 800-61"
      }
    },
    {
      "control_id": "CIS-17.2",
      "name": "Assign Job Titles and Duties for Incident Response",
      "family": "Incident Response Management",
      "description": "Define incident response roles and responsibilities",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Respond",
      "article": {
        "article_number": "17.2",
        "section_name": "Assign Incident Response Roles",
        "full_text": "Assign job titles and duties for incident response, and ensure a role includes an owner, with authority and responsibility to manage incidents.",
        "guidance": "Clear roles prevent confusion during incidents. Define: incident manager, technical leads, communications, legal, HR roles. Document responsibilities and authority. Establish escalation paths. Designate primary and backup for each role. Ensure 24/7 coverage for critical roles. Provide role-specific training. Document contact information. Include executives in appropriate roles.",
        "external_references": "NIST SP 800-61, ISO 27035"
      }
    },
    {
      "control_id": "CIS-17.3",
      "name": "Establish and Maintain Contact Information for Reporting Security Incidents",
      "family": "Incident Response Management",
      "description": "Maintain incident reporting contact information",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Respond",
      "article": {
        "article_number": "17.3",
        "section_name": "Contact Information for Reporting Incidents",
        "full_text": "Establish and maintain contact information for reporting security incidents. Verify contacts annually to ensure that information is up-to-date. Contact information should include a means of accessing the incident response team at any time of day.",
        "guidance": "Accessible reporting enables rapid response. Provide multiple reporting channels (email, phone, portal, chat). Make contact information easy to find. Ensure 24/7 availability for critical systems. Include contacts for external parties (law enforcement, regulators, vendors). Test contact methods regularly. Update emergency contact lists. Communicate reporting procedures to workforce.",
        "external_references": "NIST SP 800-61"
      }
    },
    {
      "control_id": "CIS-17.4",
      "name": "Establish and Maintain an Incident Response Process",
      "family": "Incident Response Management",
      "description": "Document incident response procedures",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Respond",
      "article": {
        "article_number": "17.4",
        "section_name": "Establish Incident Response Process",
        "full_text": "Establish and maintain an incident response process that addresses roles and responsibilities, compliance requirements, and a communication plan. Review annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Documented process ensures consistent, effective response. Address: detection, analysis, containment, eradication, recovery, post-incident activity. Define severity classification and escalation. Include communication templates and procedures. Address evidence handling and chain of custody. Document legal and regulatory notification requirements. Integrate with business continuity. Test process through exercises.",
        "external_references": "NIST SP 800-61, ISO 27035"
      }
    },
    {
      "control_id": "CIS-17.5",
      "name": "Assign Key Roles and Responsibilities",
      "family": "Incident Response Management",
      "description": "Designate incident response team members",
      "implementation_group": "IG1",
      "asset_type": "N/A",
      "security_function": "Respond",
      "article": {
        "article_number": "17.5",
        "section_name": "Assign Key Incident Response Roles",
        "full_text": "Assign key roles and responsibilities for incident response, including staff from IT, legal, HR, and other business functions. Review and update roles annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Cross-functional team addresses all incident aspects. Include: technical analysis (IT/security), legal (counsel), communications (PR), human resources (insider threats), business units (impact assessment), management (decision authority). Define when to engage each role. Document contact information. Conduct team building activities. Ensure understanding of responsibilities.",
        "external_references": "NIST SP 800-61"
      }
    },
    {
      "control_id": "CIS-17.6",
      "name": "Define Mechanisms for Communicating During Incident Response",
      "family": "Incident Response Management",
      "description": "Establish incident communication methods",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Respond",
      "article": {
        "article_number": "17.6",
        "section_name": "Incident Communication Mechanisms",
        "full_text": "Determine which primary and secondary communication mechanisms would be used to communicate during an incident. Mechanisms can include phone calls, emails, or letters. Keep in mind that certain mechanisms, such as emails, can be affected during a security incident.",
        "guidance": "Reliable communication is critical during incidents. Primary and backup channels needed (phone, secure messaging, out-of-band email). Consider that enterprise systems may be compromised or unavailable. Establish communication protocols (conference bridges, war rooms). Prepare communication templates. Define information sharing limitations. Test communication channels. Include external communication methods (customers, media, regulators).",
        "external_references": "NIST SP 800-61"
      }
    },
    {
      "control_id": "CIS-17.7",
      "name": "Conduct Routine Incident Response Exercises",
      "family": "Incident Response Management",
      "description": "Practice incident response procedures",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Respond",
      "article": {
        "article_number": "17.7",
        "section_name": "Conduct Incident Response Exercises",
        "full_text": "Plan and conduct routine incident response exercises, including tabletop exercises, technical exercises, and red team/blue team exercises. Exercises should involve relevant stakeholders, including IT, HR, legal, and communications.",
        "guidance": "Exercises test and improve incident response capabilities. Conduct tabletop exercises to walk through scenarios. Technical exercises test specific tools/procedures. Red team/blue team exercises simulate real attacks. Vary scenarios (malware, data breach, DDoS, insider threat). Include realistic complications. Document lessons learned. Update procedures based on findings. Conduct at least annually.",
        "external_references": "NIST SP 800-61, CISA tabletop exercise packages"
      }
    },
    {
      "control_id": "CIS-17.8",
      "name": "Conduct Post-Incident Reviews",
      "family": "Incident Response Management",
      "description": "Review and learn from incidents",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Recover",
      "article": {
        "article_number": "17.8",
        "section_name": "Conduct Post-Incident Reviews",
        "full_text": "Conduct post-incident reviews. Post-incident reviews help ensure that lessons learned are communicated to the right people to improve the enterprise's response to future incidents.",
        "guidance": "Learning from incidents prevents recurrence. Conduct review shortly after incident closure while details are fresh. Include all response team members. Document: timeline, root cause, what went well, what needs improvement, action items. Focus on process improvement, not blame. Share lessons learned appropriately. Track action item completion. Update procedures and training based on findings.",
        "external_references": "NIST SP 800-61, ISO 27035"
      }
    },
    {
      "control_id": "CIS-17.9",
      "name": "Establish and Maintain Security Incident Thresholds",
      "family": "Incident Response Management",
      "description": "Define incident severity thresholds",
      "implementation_group": "IG3",
      "asset_type": "N/A",
      "security_function": "Respond",
      "article": {
        "article_number": "17.9",
        "section_name": "Establish Security Incident Thresholds",
        "full_text": "Establish and maintain security incident thresholds, including, at a minimum, differentiating between an incident and an event. Examples can include: abnormal activity, security vulnerability, security weakness, data breach, privacy incident, etc. Review annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "guidance": "Clear thresholds enable appropriate response. Define incident severity levels (low, medium, high, critical) with specific criteria. Distinguish events from incidents requiring formal response. Consider factors: data sensitivity, system criticality, number of affected users, regulatory implications. Define escalation triggers. Document notification requirements by severity. Use consistent classification. Review and adjust thresholds based on experience.",
        "external_references": "NIST SP 800-61"
      }
    },
    {
      "control_id": "CIS-18.1",
      "name": "Establish and Maintain a Penetration Testing Program",
      "family": "Penetration Testing",
      "description": "Create formalized penetration testing program",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Detect",
      "article": {
        "article_number": "18.1",
        "section_name": "Establish Penetration Testing Program",
        "full_text": "Establish and maintain a penetration testing program appropriate to the size, complexity, and maturity of the enterprise. Penetration testing program characteristics include: scope, such as network, web application, API, hosted services, and physical premise controls; frequency; limitations, such as acceptable hours, and excluded attack types; threat model; drive-by compromise prevention; and remediation workflow.",
        "guidance": "Penetration testing validates security controls under adversarial conditions. Define scope (external, internal, applications, physical, social). Determine frequency based on risk (annually minimum for IG2, more frequent for high-risk systems). Use qualified testers (internal team or external firm). Follow rules of engagement. Establish reporting and remediation processes. Track findings to closure. Consider continuous testing approaches.",
        "external_references": "PTES, OWASP Testing Guide, NIST SP 800-115"
      }
    },
    {
      "control_id": "CIS-18.2",
      "name": "Perform Periodic External Penetration Tests",
      "family": "Penetration Testing",
      "description": "Conduct external penetration tests",
      "implementation_group": "IG2",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "18.2",
        "section_name": "Perform External Penetration Tests",
        "full_text": "Perform periodic external penetration tests based on program requirements, no less than annually. External penetration testing must include enterprise and environmental reconnaissance to detect exploitable information. Penetration testing requires specialized skills and experience and must be conducted through a qualified party. The testing may be clear box or opaque box.",
        "guidance": "External testing simulates attacker perspective. Test internet-facing systems (websites, VPN, email, DNS). Include reconnaissance phase. Test for OWASP Top 10 and common vulnerabilities. Attempt to gain unauthorized access. Document all findings. Provide detailed report with remediation guidance. Retest after remediation. Consider both authenticated and unauthenticated testing. Use qualified, experienced testers.",
        "external_references": "PTES, PCI DSS Requirement 11.3"
      }
    },
    {
      "control_id": "CIS-18.3",
      "name": "Remediate Penetration Test Findings",
      "family": "Penetration Testing",
      "description": "Fix vulnerabilities discovered during penetration tests",
      "implementation_group": "IG2",
      "asset_type": "N/A",
      "security_function": "Respond",
      "article": {
        "article_number": "18.3",
        "section_name": "Remediate Penetration Test Findings",
        "full_text": "Remediate penetration test findings based on the enterprise's policy for remediation scope and prioritization.",
        "guidance": "Testing is only valuable if findings are addressed. Prioritize remediation by severity and exploitability. Set remediation timelines (critical: 30 days, high: 60 days, etc.). Track findings to closure. Verify remediation effectiveness through retesting. Document risk acceptance for findings that cannot be immediately remediated. Report remediation status to management. Use findings to improve security program.",
        "external_references": "NIST SP 800-115"
      }
    },
    {
      "control_id": "CIS-18.4",
      "name": "Validate Security Measures",
      "family": "Penetration Testing",
      "description": "Validate that security controls function as intended",
      "implementation_group": "IG3",
      "asset_type": "N/A",
      "security_function": "Detect",
      "article": {
        "article_number": "18.4",
        "section_name": "Validate Security Measures",
        "full_text": "Validate security measures after each penetration test. If deemed necessary, modify the enterprise's security plan, incident response plan, and penetration testing program.",
        "guidance": "Validation ensures controls work as designed. Review test findings against security architecture and controls. Identify control gaps or failures. Assess whether controls detected/prevented test activities. Update security measures based on findings. Modify security policies and standards. Enhance detection capabilities. Improve incident response based on lessons learned. Update threat model with observed attack techniques.",
        "external_references": "NIST SP 800-115"
      }
    },
    {
      "control_id": "CIS-18.5",
      "name": "Perform Periodic Internal Penetration Tests",
      "family": "Penetration Testing",
      "description": "Conduct internal penetration tests",
      "implementation_group": "IG3",
      "asset_type": "Network",
      "security_function": "Detect",
      "article": {
        "article_number": "18.5",
        "section_name": "Perform Internal Penetration Tests",
        "full_text": "Perform periodic internal penetration tests based on program requirements, no less than annually. The testing may be clear box or opaque box.",
        "guidance": "Internal testing simulates insider threat or post-compromise scenario. Test from inside network perimeter. Attempt lateral movement and privilege escalation. Test segmentation effectiveness. Target high-value systems. Assess detective controls. Document paths to critical assets. Internal tests should simulate both malicious insider and compromised account scenarios. Use qualified testers. Remediate findings.",
        "external_references": "PTES, NIST SP 800-115"
      }
    }
  ]
}
